import { useRouter } from 'next/router';
import Layout from '../app/components/layout';
import styles from '../app/Home.module.css';

const Page = () => {
  const router = useRouter();
  const { page, video } = router.query;

  const renderContent = () => {
    switch (page) {
      case 'page1':
        return (
          <div className={styles.pageContent}>
            <h1>عند شعورك بالذنب </h1>
            <h2>(مزمور 32)</h2>
            <p> طُوبَى لِلَّذِي غُفِرَ إِثْمُهُ وَسُتِرَتْ خَطِيَّتُهُ. 2 طُوبَى لِرَجُل لاَ يَحْسِبُ لَهُ الرَّبُّ خَطِيَّةً، وَلاَ فِي رُوحِهِ غِشٌّ.
3 لَمَّا سَكَتُّ بَلِيَتْ عِظَامِي مِنْ زَفِيرِي الْيَوْمَ كُلَّهُ، 4 لأَنَّ يَدَكَ ثَقُلَتْ عَلَيَّ نَهَارًا وَلَيْلاً. تَحَوَّلَتْ رُطُوبَتِي إِلَى يُبُوسَةِ الْقَيْظِ. سِلاَهْ. 5 أَعْتَرِفُ لَكَ بِخَطِيَّتِي وَلاَ أَكْتُمُ إِثْمِي. قُلْتُ: «أَعْتَرِفُ لِلرَّبِّ بِذَنْبِي» وَأَنْتَ رَفَعْتَ أَثَامَ خَطِيَّتِي. سِلاَهْ. 6 لِهذَا يُصَلِّي لَكَ كُلُّ تَقِيٍّفِي وَقْتٍ يَجِدُكَ فِيهِ. عِنْدَ غَمَارَةِ الْمِيَاهِ الْكَثِيرَةِ إِيَّاهُ لاَ تُصِيبُ. 7 أَنْتَ سِتْرٌ لِي. مِنَ الضِّيقِ تَحْفَظُنِي. بِتَرَنُّمِ النَّجَاةِ تَكْتَنِفُنِي. سِلاَهْ.
8 «أُعَلِّمُكَ وَأُرْشِدُكَ الطَّرِيقَ الَّتِي تَسْلُكُهَا. أَنْصَحُكَ. عَيْنِي عَلَيْكَ. 9 لاَ تَكُونُوا كَفَرَسٍ أَوْ بَغْل بِلاَ فَهْمٍ. بِلِجَامٍ وَزِمَامٍ زِينَتِهِ يُكَمُّ لِئَلاَّ يَدْنُوَ إِلَيْكَ». 10 كَثِيرَةٌ هِيَ نَكَبَاتُ الشِّرِّيرِ، أَمَّا الْمُتَوَكِّلُ عَلَى الرَّبِّ فَالرَّحْمَةُ تُحِيطُ بِهِ. 11 افْرَحُوا بِالرَّبِّ وَابْتَهِجُوا يَا أَيُّهَا الصِّدِّيقُونَ، وَاهْتِفُوا يَا جَمِيعَ الْمُسْتَقِيمِي الْقُلُوبِ.</p>
            <h3>(رو1:8-2)</h3>
            <p>1 إِذًا لاَ شَيْءَ مِنَ الدَّيْنُونَةِ الآنَ عَلَى الَّذِينَ هُمْ فِي الْمَسِيحِ يَسُوعَ، السَّالِكِينَ لَيْسَ حَسَبَ الْجَسَدِ بَلْ حَسَبَ الرُّوحِ. 2 لأَنَّ نَامُوسَ رُوحِ الْحَيَاةِ فِي الْمَسِيحِ يَسُوعَ قَدْ أَعْتَقَنِي مِنْ نَامُوسِ الْخَطِيَّةِ وَالْمَوْتِ.(رو1:8-2)</p>
            {video && (
              <div className={styles.videoContainer}>
                <iframe width="100%" height="auto" src="https://www.youtube.com/embed/FPOd3lCBNHI" title="إحساس الذنب  - سلسلة اطمّن - أبونا داود لمعي" frameBorder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerPolicy="strict-origin-when-cross-origin" allowFullScreen></iframe>
              </div>
            )}
          </div>
        );
      case 'page2':
        return (
          <div className={styles.pageContent}>
            <h1>عند شعورك بالاكتئاب</h1>
            <h2>(مز42)</h2>
            <p>  لإِمَامِ الْمُغَنِّينَ. قَصِيدَةٌ لِبَنِي قُورَحَ
1 كَمَا يَشْتَاقُ الإِيَّلُ إِلَى جَدَاوِلِ الْمِيَاهِ، هكَذَا تَشْتَاقُ نَفْسِي إِلَيْكَ يَا اللهُ. 2 عَطِشَتْ نَفْسِي إِلَى اللهِ، إِلَى الإِلهِ الْحَيِّ. مَتَى أَجِيءُ وَأَتَرَاءَى قُدَّامَ اللهِ ؟ 3 صَارَتْ لِي دُمُوعِي خُبْزًا نَهَارًا وَلَيْلاً إِذْ قِيلَ لِي كُلَّ يَوْمٍ: «أَيْنَ إِلهُكَ؟ ». 4 هذِهِ أَذْكُرُهَا فَأَسْكُبُ نَفْسِي عَلَيَّ: لأَنِّي كُنْتُ أَمُرُّ مَعَ الْجُمَّاعِ، أَتَدَرَّجُ مَعَهُمْ إِلَى بَيْتِ اللهِ بِصَوْتِ تَرَنُّمٍ وَحَمْدٍ، جُمْهُورٌ مُعَيِّدٌ. 5 لِمَاذَا أَنْتِ مُنْحَنِيَةٌ يَا نَفْسِي؟ وَلِمَاذَا تَئِنِّينَ فِيَّ؟ ارْتَجِي اللهَ، لأَنِّي بَعْدُ أَحْمَدُهُ، لأَجْلِ خَلاَصِ وَجْهِهِ.
6 يَا إِلهِي، نَفْسِي مُنْحَنِيَةٌ فِيَّ، لِذلِكَ أَذْكُرُكَ مِنْ أَرْضِ الأُرْدُنِّ وَجِبَالِ حَرْمُونَ، مِنْ جَبَلِ مِصْعَرَ. 7 غَمْرٌ يُنَادِي غَمْرًا عِنْدَ صَوْتِ مَيَازِيبِكَ. كُلُّ تَيَّارَاتِكَ وَلُجَجِكَ طَمَتْ عَلَيَّ. 8 بِالنَّهَارِ يُوصِي الرَّبُّ رَحْمَتَهُ، وَبِاللَّيْلِ تَسْبِيحُهُ عِنْدِي صَلاَةٌ لإِلهِ حَيَاتِي. 9 أَقُولُ ِللهِ صَخْرَتِي: «لِمَاذَا نَسِيتَنِي؟ لِمَاذَا أَذْهَبُ حَزِينًا مِنْ مُضَايَقَةِ الْعَدُوِّ؟ ». 10 بِسَحْق فِي عِظَامِي عَيَّرَنِي مُضَايِقِيَّ، بِقَوْلِهِمْ لِي كُلَّ يَوْمٍ: «أَيْنَ إِلهُكَ؟ ». 11 لِمَاذَا أَنْتِ مُنْحَنِيَةٌ يَا نَفْسِي؟ وَلِمَاذَا تَئِنِّينَ فِيَّ؟ تَرَجَّيِاللهَ، لأَنِّي بَعْدُ أَحْمَدُهُ، خَلاَصَ وَجْهِي وَإِلهِي. </p>
<h3>(2كو7:4-14)</h3>
<p>7 وَلكِنْ لَنَا هذَا الْكَنْزُ فِي أَوَانٍ خَزَفِيَّةٍ، لِيَكُونَ فَضْلُ الْقُوَّةِ ِللهِ لاَ مِنَّا. 8 مُكْتَئِبِينَ فِي كُلِّ شَيْءٍ، لكِنْ غَيْرَ مُتَضَايِقِينَ. مُتَحَيِّرِينَ، لكِنْ غَيْرَ يَائِسِينَ. 9 مُضْطَهَدِينَ، لكِنْ غَيْرَ مَتْرُوكِينَ. مَطْرُوحِينَ، لكِنْ غَيْرَ هَالِكِينَ. 10 حَامِلِينَ فِي الْجَسَدِ كُلَّ حِينٍ إِمَاتَةَ الرَّبِّ يَسُوعَ، لِكَيْ تُظْهَرَ حَيَاةُ يَسُوعَ أَيْضًا فِي جَسَدِنَا. 11 لأَنَّنَا نَحْنُ الأَحْيَاءَ نُسَلَّمُ دَائِمًا لِلْمَوْتِ مِنْ أَجْلِ يَسُوعَ، لِكَيْ تَظْهَرَ حَيَاةُ يَسُوعَ أَيْضًا فِي جَسَدِنَا الْمَائِتِ. 12 إِذًا الْمَوْتُ يَعْمَلُ فِينَا، وَلكِنِ الْحَيَاةُ فِيكُمْ. 13 فَإِذْ لَنَا رُوحُ الإِيمَانِ عَيْنُهُ، حَسَبَ الْمَكْتُوب:«آمَنْتُ لِذلِكَ تَكَلَّمْتُ»، نَحْنُ أَيْضًا نُؤْمِنُ وَلِذلِكَ نَتَكَلَّمُ أَيْضًا. 14 عَالِمِينَ أَنَّ الَّذِي أَقَامَ الرَّبَّ يَسُوعَ سَيُقِيمُنَا نَحْنُ أَيْضًا بِيَسُوعَ، وَيُحْضِرُنَا مَعَكُمْ.</p>
{video && (
              <div className={styles.videoContainer}>
<iframe width="708" height="398" src="https://www.youtube.com/embed/y1HhAhqOx6Y" title="الإكتئاب مرض العصر - سلسلة اطمّن - أبونا داود لمعي" frameBorder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerPolicy="strict-origin-when-cross-origin" allowFullScreen></iframe>              </div>
            )}
          </div>
        );
      case 'page3':
        return (
          <div className={styles.pageContent}>
            <h1>عند شعورك بالقلق</h1>
            <h2>(مز23)</h2>
            <p> مَزْمُورٌ لِدَاوُدَ
            
 الرَّبُّ رَاعِيَّ فَلاَ يُعْوِزُنِي شَيْءٌ. 2 فِي مَرَاعٍ خُضْرٍ يُرْبِضُنِي. إِلَى مِيَاهِ الرَّاحَةِ يُورِدُنِي. 3 يَرُدُّ نَفْسِي. يَهْدِينِي إِلَى سُبُلِ الْبِرِّ مِنْ أَجْلِ اسْمِهِ. 4 أَيْضًا إِذَا سِرْتُ فِي وَادِي ظِلِّ الْمَوْتِ لاَ أَخَافُ شَرًّا، لأَنَّكَ أَنْتَ مَعِي. عَصَاكَ وَعُكَّازُكَ هُمَا يُعَزِّيَانِنِي. 5 تُرَتِّبُ قُدَّامِي مَائِدَةً تُجَاهَ مُضَايِقِيَّ. مَسَحْتَ بِالدُّهْنِ رَأْسِي. كَأْسِي رَيَّا. 6 إِنَّمَا خَيْرٌ وَرَحْمَةٌ يَتْبَعَانِنِي كُلَّ أَيَّامِ حَيَاتِي، وَأَسْكُنُ فِي بَيْتِ الرَّبِّ إِلَى مَدَى الأَيَّامِ.</p>
 <h3>(مت24:6-34)</h3>
<p>24 «لاَ يَقْدِرُ أَحَدٌ أَنْ يَخْدِمَ سَيِّدَيْنِ، لأَنَّهُ إِمَّا أَنْ يُبْغِضَ الْوَاحِدَ وَيُحِبَّ الآخَرَ، أَوْ يُلاَزِمَ الْوَاحِدَ وَيَحْتَقِرَ الآخَرَ. لاَ تَقْدِرُونَ أَنْ تَخْدِمُوا اللهَ وَالْمَالَ. 25 «لِذلِكَ أَقُولُ لَكُمْ: لاَ تَهْتَمُّوا لِحَيَاتِكُمْ بِمَا تَأْكُلُونَ وَبِمَا تَشْرَبُونَ، وَلاَ لأَجْسَادِكُمْ بِمَا تَلْبَسُونَ. أَلَيْسَتِ الْحَيَاةُ أَفْضَلَ مِنَ الطَّعَامِ، وَالْجَسَدُ أَفْضَلَ مِنَ اللِّبَاسِ؟ 26 اُنْظُرُوا إِلَى طُيُورِ السَّمَاءِ: إِنَّهَا لاَ تَزْرَعُ وَلاَ تَحْصُدُ وَلاَ تَجْمَعُ إِلَى مَخَازِنَ، وَأَبُوكُمُ السَّمَاوِيُّ يَقُوتُهَا. أَلَسْتُمْ أَنْتُمْ بِالْحَرِيِّ أَفْضَلَ مِنْهَا؟ 27 وَمَنْ مِنْكُمْ إِذَا اهْتَمَّ يَقْدِرُ أَنْ يَزِيدَ عَلَى قَامَتِهِ ذِرَاعًا وَاحِدَةً؟ 28 وَلِمَاذَا تَهْتَمُّونَ بِاللِّبَاسِ؟ تَأَمَّلُوا زَنَابِقَ الْحَقْلِ كَيْفَ تَنْمُو! لاَ تَتْعَبُ وَلاَ تَغْزِلُ. 29 وَلكِنْ أَقُولُ لَكُمْ: إِنَّهُ وَلاَ سُلَيْمَانُ فِي كُلِّ مَجْدِهِ كَانَ يَلْبَسُ كَوَاحِدَةٍ مِنْهَا. 30 فَإِنْ كَانَ عُشْبُ الْحَقْلِ الَّذِي يُوجَدُ الْيَوْمَ وَيُطْرَحُ غَدًا فِي التَّنُّورِ، يُلْبِسُهُ اللهُ هكَذَا، أَفَلَيْسَ بِالْحَرِيِّ جِدًّا يُلْبِسُكُمْ أَنْتُمْ يَا قَلِيلِي الإِيمَانِ؟ 31 فَلاَ تَهْتَمُّوا قَائِلِينَ: مَاذَا نَأْكُلُ؟ أَوْ مَاذَا نَشْرَبُ؟ أَوْ مَاذَا نَلْبَسُ؟ 32 فَإِنَّ هذِهِ كُلَّهَا تَطْلُبُهَا الأُمَمُ. لأَنَّ أَبَاكُمُ السَّمَاوِيَّ يَعْلَمُ أَنَّكُمْ تَحْتَاجُونَ إِلَى هذِهِ كُلِّهَا. 33 لكِنِ اطْلُبُوا أَوَّلاً مَلَكُوتَ اللهِ وَبِرَّهُ، وَهذِهِ كُلُّهَا تُزَادُ لَكُمْ. 34 فَلاَ تَهْتَمُّوا لِلْغَدِ، لأَنَّ الْغَدَ يَهْتَمُّ بِمَا لِنَفْسِهِ. يَكْفِي الْيَوْمَ شَرُّهُ.(مت24:6-34)</p>
{video && (
              <div className={styles.videoContainer}>
<iframe width="708" height="398" src="https://www.youtube.com/embed/m2HNdf7OSuc" title="خلى قلبك قوى ميعرفش الخوف❤️💪🏻 قداسة البابا شنودة الثالث #قناة_الحرية" frameBorder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerPolicy="strict-origin-when-cross-origin" allowFullScreen></iframe>              </div>
            )}
          </div>
        );
        case 'page4':
        return(
          <div className={styles.pageContent}>
            <h1>عند شعورك بالخوف</h1>
            <h2>(مز27)</h2>
            <p>1 اَلرَّبُّ نُورِي وَخَلاَصِي، مِمَّنْ أَخَافُ؟ الرَّبُّ حِصْنُ حَيَاتِي، مِمَّنْ أَرْتَعِبُ؟ 2 عِنْدَ مَا اقْتَرَبَ إِلَيَّ الأَشْرَارُ لِيَأْكُلُوا لَحْمِي، مُضَايِقِيَّ وَأَعْدَائِي عَثَرُوا وَسَقَطُوا. 3 إِنْ نَزَلَ عَلَيَّ جَيْشٌ لاَ يَخَافُ قَلْبِي. إِنْ قَامَتْ عَلَيَّ حَرْبٌ فَفِي ذلِكَ أَنَا مُطْمَئِنٌّ. 4 وَاحِدَةً سَأَلْتُ مِنَ الرَّبِّ وَإِيَّاهَا أَلْتَمِسُ: أَنْ أَسْكُنَ فِي بَيْتِ الرَّبِّ كُلَّ أَيَّامِ حَيَاتِي، لِكَيْ أَنْظُرَ إِلَى جَمَالِ الرَّبِّ، وَأَتَفَرَّسَ فِي هَيْكَلِهِ. 5 لأَنَّهُ يُخَبِّئُنِي فِي مَظَلَّتِهِ فِي يَوْمِ الشَّرِّ. يَسْتُرُنِي بِسِتْرِ خَيْمَتِهِ. عَلَى صَخْرَةٍ يَرْفَعُنِي. 6 وَالآنَ يَرْتَفِعُ رَأْسِي عَلَى أَعْدَائِي حَوْلِي، فَأَذْبَحُ فِي خَيْمَتِهِ ذَبَائِحَ الْهُتَافِ. أُغَنِّي وَأُرَنِّمُ لِلرَّبِّ.

7 اِسْتَمِعْ يَا رَبُّ. بِصَوْتِي أَدْعُو فَارْحَمْنِي وَاسْتَجِبْ لِي. 8 لَكَ قَالَ قَلْبِي: «قُلْتَ: اطْلُبُوا وَجْهِي». وَجْهَكَ يَا رَبُّ أَطْلُبُ. 9 لاَ تَحْجُبْ وَجْهَكَ عَنِّي. لاَ تُخَيِّبْ بِسَُخْطٍ عَبْدَكَ. قَدْ كُنْتَ عَوْنِي فَلاَ تَرْفُضْنِي وَلاَ تَتْرُكْنِي يَا إِلهَ خَلاَصِي. 10 إِنَّ أَبِي وَأُمِّي قَدْ تَرَكَانِي وَالرَّبُّ يَضُمُّنِي. 11 عَلِّمْنِي يَا رَبُّ طَرِيقَكَ، وَاهْدِنِي فِي سَبِيل مُسْتَقِيمٍ بِسَبَبِ أَعْدَائِي. 12 لاَ تُسَلِّمْنِي إِلَى مَرَامِ مُضَايِقِيَّ، لأَنَّهُ قَدْ قَامَ عَلَيَّ شُهُودُ زُورٍ وَنَافِثُ ظُلْمٍ. 13 لَوْلاَ أَنَّنِي آمَنْتُ بِأَنْ أَرَى جُودَ الرَّبِّ فِي أَرْضِ الأَحْيَاءِ. 14 انْتَظِرِ الرَّبَّ. لِيَتَشَدَّدْ وَلْيَتَشَجَّعْ قَلْبُكَ، وَانْتَظِرِ الرَّبَّ.</p>
<h3>(في27:1-30)</h3>
<p>27 فَقَطْ عِيشُوا كَمَا يَحِقُّ لإِنْجِيلِ الْمَسِيحِ، حَتَّى إِذَا جِئْتُ وَرَأَيْتُكُمْ، أَوْ كُنْتُ غَائِبًا أَسْمَعُ أُمُورَكُمْ أَنَّكُمْ تَثْبُتُونَ فِي رُوحٍ وَاحِدٍ، مُجَاهِدِينَ مَعًا بِنَفْسٍ وَاحِدَةٍ لإِيمَانِ الإِنْجِيلِ، 28 غَيْرَ مُخَوَّفِينَ بِشَيْءٍ مِنَ الْمُقَاوِمِينَ، الأَمْرُ الَّذِي هُوَ لَهُمْ بَيِّنَةٌ لِلْهَلاَكِ، وَأَمَّا لَكُمْ فَلِلْخَلاَصِ، وَذلِكَ مِنَ اللهِ. 29 لأَنَّهُ قَدْ وُهِبَ لَكُمْ لأَجْلِ الْمَسِيحِ لاَ أَنْ تُؤْمِنُوا بِهِ فَقَطْ، بَلْ أَيْضًا أَنْ تَتَأَلَّمُوا لأَجْلِهِ. 30 إِذْ لَكُمُ الْجِهَادُ عَيْنُهُ الَّذِي رَأَيْتُمُوهُ فِيَّ، وَالآنَ تَسْمَعُونَ فِيَّ.</p>

{video && (
              <div className={styles.videoContainer}>
<iframe width="708" height="398" src="https://www.youtube.com/embed/kHP6Gp0C-mw" title="الخوف أسبابه وعلاجه في دقيقة - سلسلة اطمّن - أبونا داود لمعي" frameBorder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerPolicy="strict-origin-when-cross-origin" allowFullScreen></iframe>              </div>
            )}
          </div>
        );
        case 'page5':
          return (
            <div className={styles.pageContent}>
              <h1>عند شعورك بالضعف</h1>
              <h2>(مز8:145-21)</h2>
              <p>8 اَلرَّبُّ حَنَّانٌ وَرَحِيمٌ، طَوِيلُ الرُّوحِ وَكَثِيرُ الرَّحْمَةِ. 9 الرَّبُّ صَالِحٌ لِلْكُلِّ، وَمَرَاحِمُهُ عَلَى كُلِّ أَعْمَالِهِ. 10 يَحْمَدُكَ يَا رَبُّ كُلُّ أَعْمَالِكَ، وَيُبَارِكُكَ أَتْقِيَاؤُكَ. 11 بِمَجْدِ مُلْكِكَ يَنْطِقُونَ، وَبِجَبَرُوتِكَ يَتَكَلَّمُونَ، 12 لِيُعَرِّفُوا بَنِي آدَمَ قُدْرَتَكَ وَمَجْدَ جَلاَلِ مُلْكِكَ. 13 مُلْكُكَ مُلْكُ كُلِّ الدُّهُورِ، وَسُلْطَانُكَ فِي كُلِّ دَوْرٍ فَدَوْرٍ.

14 اَلرَّبُّ عَاضِدٌ كُلَّ السَّاقِطِينَ، وَمُقَوِّمٌ كُلَّ الْمُنْحَنِينَ. 15 أَعْيُنُ الْكُلِّ إِيَّاكَ تَتَرَجَّى، وَأَنْتَ تُعْطِيهِمْ طَعَامَهُمْ فِي حِينِهِ. 16 تَفْتَحُ يَدَكَ فَتُشْبعُ كُلَّ حَيٍّ رِضًى. 17 الرَّبُّ بَارٌّ فِي كُلِّ طُرُقِهِ، وَرَحِيمٌ فِي كُلِّ أَعْمَالِهِ. 18 الرَّبُّ قَرِيبٌ لِكُلِّ الَّذِينَ يَدْعُونَهُ، الَّذِينَ يَدْعُونَهُ بِالْحَقِّ. 19 يَعْمَلُ رِضَى خَائِفِيهِ، وَيَسْمَعُ تَضَرُّعَهُمْ، فَيُخَلِّصُهُمْ. 20 يَحْفَظُ الرَّبُّ كُلَّ مُحِبِّيهِ، وَيُهْلِكُ جَمِيعَ الأَشْرَارِ. 21 بِتَسْبِيحِ الرَّبِّ يَنْطِقُ فَمِي، وَلِْيُبَارِكْ كُلُّ بَشَرٍ اسْمَهُ الْقُدُّوسَ إِلَى الدَّهْرِ وَالأَبَدِ.</p>
<h3>(1كو26:1-31)</h3>
<p>26 فَانْظُرُوا دَعْوَتَكُمْ أَيُّهَا الإِخْوَةُ، أَنْ لَيْسَ كَثِيرُونَ حُكَمَاءَ حَسَبَ الْجَسَدِ، لَيْسَ كَثِيرُونَ أَقْوِيَاءَ، لَيْسَ كَثِيرُونَ شُرَفَاءَ، 27 بَلِ اخْتَارَ اللهُ جُهَّالَ الْعَالَمِ لِيُخْزِيَ الْحُكَمَاءَ. وَاخْتَارَ اللهُ ضُعَفَاءَ الْعَالَمِ لِيُخْزِيَ الأَقْوِيَاءَ. 28 وَاخْتَارَ اللهُ أَدْنِيَاءَ الْعَالَمِ وَالْمُزْدَرَى وَغَيْرَ الْمَوْجُودِ لِيُبْطِلَ الْمَوْجُودَ، 29 لِكَيْ لاَ يَفْتَخِرَ كُلُّ ذِي جَسَدٍ أَمَامَهُ. 30 وَمِنْهُ أَنْتُمْ بِالْمَسِيحِ يَسُوعَ، الَّذِي صَارَ لَنَا حِكْمَةً مِنَ اللهِ وَبِرًّا وَقَدَاسَةً وَفِدَاءً. 31 حَتَّى كَمَا هُوَ مَكْتُوبٌ:«مَنِ افْتَخَرَ فَلْيَفْتَخِرْ بِالرَّبِّ».</p>

{video && (
              <div className={styles.videoContainer}>
<iframe width="708" height="398" src="https://www.youtube.com/embed/jNlYfkMlCiI" title="الضغوط - سلسلة اطمّن - أبونا داود لمعي" frameBorder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerPolicy="strict-origin-when-cross-origin" allowFullScreen></iframe>              </div>
            )}
          </div>
        );
          case 'page6':
          return (
            <div className={styles.pageContent}>
              <h1>عند شعورك بعدم الأمان</h1>
              <h2>(مز1:43-5)</h2>
              <p>1 اِقْضِ لِي يَا اَللهُ، وَخَاصِمْ مُخَاصَمَتِي مَعَ أُمَّةٍ غَيْرِ رَاحِمَةٍ، وَمِنْ إِنْسَانِ غِشٍّ وَظُلْمٍ نَجِّنِي. 2 لأَنَّكَ أَنْتَ إِلهُ حِصْنِي. لِمَاذَا رَفَضْتَنِي؟ لِمَاذَا أَتَمَشَّى حَزِينًا مِنْ مُضَايَقَةِ الْعَدُوِّ؟ 3 أَرْسِلْ نُورَكَ وَحَقَّكَ، هُمَا يَهْدِيَانِنِي وَيَأْتِيَانِ بِي إِلَى جَبَلِ قُدْسِكَ وَإِلَى مَسَاكِنِكَ. 4 فَآتِي إِلَى مَذْبَحِ اللهِ، إِلَى اللهِ بَهْجَةِ فَرَحِي، وَأَحْمَدُكَ بِالْعُودِ يَا اَللهُ إِلهِي. 5 لِمَاذَا أَنْتِ مُنْحَنِيَةٌ يَا نَفْسِي؟ وَلِمَاذَا تَئِنِّينَ فِيَّ؟ تَرَجَّيِ اللهَ، لأَنِّي بَعْدُ أَحْمَدُهُ، خَلاَصَ وَجْهِي وَإِلهِي.</p>
              <h3>(لو1:12-12)</h3>
              <p>1 وَفِي أَثْنَاءِ ذلِكَ، إِذِ اجْتَمَعَ رَبَوَاتُ الشَّعْبِ، حَتَّى كَانَ بَعْضُهُمْ يَدُوسُ بَعْضًا، ابْتَدَأَ يَقُولُ لِتَلاَمِيذِهِ: «أَوَّلاً تَحَرَّزُوا لأَنْفُسِكُمْ مِنْ خَمِيرِ الْفَرِّيسِيِّينَ الَّذِي هُوَ الرِّيَاءُ، 2 فَلَيْسَ مَكْتُومٌ لَنْ يُسْتَعْلَنَ، وَلاَ خَفِيٌّ لَنْ يُعْرَفَ. 3 لِذلِكَ كُلُّ مَا قُلْتُمُوهُ فِي الظُّلْمَةِ يُسْمَعُ فِي النُّورِ، وَمَا كَلَّمْتُمْ بِهِ الأُذْنَ فِي الْمَخَادِعِ يُنَادَى بِهِ عَلَى السُّطُوحِ. 4 وَلكِنْ أَقُولُ لَكُمْ يَا أَحِبَّائِي: لاَ تَخَافُوا مِنَ الَّذِينَ يَقْتُلُونَ الْجَسَدَ، وَبَعْدَ ذلِكَ لَيْسَ لَهُمْ مَا يَفْعَلُونَ أَكْثَرَ. 5 بَلْ أُرِيكُمْ مِمَّنْ تَخَافُونَ: خَافُوا مِنَ الَّذِي بَعْدَمَا يَقْتُلُ، لَهُ سُلْطَانٌ أَنْ يُلْقِيَ فِي جَهَنَّمَ. نَعَمْ، أَقُولُ لَكُمْ: مِنْ هذَا خَافُوا! 6 أَلَيْسَتْ خَمْسَةُ عَصَافِيرَ تُبَاعُ بِفَلْسَيْنِ، وَوَاحِدٌ مِنْهَا لَيْسَ مَنْسِيًّا أَمَامَ اللهِ؟ 7 بَلْ شُعُورُ رُؤُوسِكُمْ أَيْضًا جَمِيعُهَا مُحْصَاةٌ. فَلاَ تَخَافُوا! أَنْتُمْ أَفْضَلُ مِنْ عَصَافِيرَ كَثِيرَةٍ! 8 وَأَقُولُ لَكُمْ: كُلُّ مَنِ اعْتَرَفَ بِي قُدَّامَ النَّاسِ، يَعْتَرِفُ بِهِ ابْنُ الإِنْسَانِ قُدَّامَ مَلاَئِكَةِ اللهِ. 9 وَمَنْ أَنْكَرَنِي قُدَّامَ النَّاسِ، يُنْكَرُ قُدَّامَ مَلاَئِكَةِ اللهِ. 10 وَكُلُّ مَنْ قَالَ كَلِمَةً عَلَى ابْنِ الإِنْسَانِ يُغْفَرُ لَهُ، وَأَمَّا مَنْ جَدَّفَ عَلَى الرُّوحِ الْقُدُسِ فَلاَ يُغْفَرُ لَهُ. 11 وَمَتَى قَدَّمُوكُمْ إِلَى الْمَجَامِعِ وَالرُّؤَسَاءِ وَالسَّلاَطِينِ فَلاَ تَهْتَمُّوا كَيْفَ أَوْ بِمَا تَحْتَجُّونَ أَوْ بِمَا تَقُولُونَ، 12 لأَنَّ الرُّوحَ الْقُدُسَ يُعَلِّمُكُمْ فِي تِلْكَ السَّاعَةِ مَا يَجِبُ أَنْ تَقُولُوهُ».</p>
              {video && (
              <div className={styles.videoContainer}>
<iframe width="531" height="398" src="https://www.youtube.com/embed/MRl7Ah01Ex8" title="الشعور بعدم الامان يولد انانية - كلام مهم جدا من ابونا داود لمعى @ قناة اغابى" frameBorder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerPolicy="strict-origin-when-cross-origin" allowFullScreen></iframe>              </div>
            )}
          </div>
        );
          case 'page7':
          return (
            <div className={styles.pageContent}>
              <h1>عند شعورك بالاضطهاد</h1>
              <h2>(مزمور142)</h2>
              <p>1 بِصَوْتِي إِلَى الرَّبِّ أَصْرُخُ. بِصَوْتِي إِلَى الرَّبِّ أَتَضَرَّعُ. 2 أَسْكُبُ أَمَامَهُ شَكْوَايَ. بِضِيقِيْ قُدَّامَهُ أُخْبِرُ. 3 عِنْدَ مَا أَعْيَتْ رُوحِي فِيَّ، وَأَنْتَ عَرَفْتَ مَسْلَكِي. فِي الطَّرِيقِ الَّتِي أَسْلُكُ أَخْفَوْا لِي فَخًّا. 4 انْظُرْ إِلَى الْيَمِينِ وَأَبْصِرْ، فَلَيْسَ لِي عَارِفٌ. بَادَ عَنِّي الْمَنَاصُ. لَيْسَ مَنْ يَسْأَلُ عَنْ نَفْسِي. 5 صَرَخْتُ إِلَيْكَ يَا رَبُّ. قُلْتُ: «أَنْتَ مَلْجَإِي، نَصِيبِي فِي أَرْضِ الأَحْيَاءِ». 6 أَصْغِ إِلَى صُرَاخِي، لأَنِّي قَدْ تَذَلَّلْتُ جِدًّا. نَجِّنِي مِنْ مُضْطَهِدِيَّ، لأَنَّهُمْ أَشَدُّ مِنِّي. 7 أَخْرِجْ مِنَ الْحَبْسِ نَفْسِي، لِتَحْمِيدِ اسْمِكَ. الصِّدِّيقُونَ يَكْتَنِفُونَنِي، لأَنَّكَ تُحْسِنُ إِلَيَّ.</p>
              <h3>(2تيموثاوس10:3-14)</h3>
              <p>10 وَأَمَّا أَنْتَ فَقَدْ تَبِعْتَ تَعْلِيمِي، وَسِيرَتِي، وَقَصْدِي، وَإِيمَانِي، وَأَنَاتِي، وَمَحَبَّتِي، وَصَبْرِي، 11 وَاضْطِهَادَاتِي، وَآلاَمِي، مِثْلَ مَا أَصَابَنِي فِي أَنْطَاكِيَةَ وَإِيقُونِيَّةَ وَلِسْتِرَةَ. أَيَّةَ اضْطِهَادَاتٍ احْتَمَلْتُ! وَمِنَ الْجَمِيعِ أَنْقَذَنِي الرَّبُّ. 12 وَجَمِيعُ الَّذِينَ يُرِيدُونَ أَنْ يَعِيشُوا بِالتَّقْوَى فِي الْمَسِيحِ يَسُوعَ يُضْطَهَدُونَ. 13 وَلكِنَّ النَّاسَ الأَشْرَارَ الْمُزَوِّرِينَ سَيَتَقَدَّمُونَ إِلَى أَرْدَأَ، مُضِلِّينَ وَمُضَلِّينَ. 14 وَأَمَّا أَنْتَ فَاثْبُتْ عَلَى مَا تَعَلَّمْتَ وَأَيْقَنْتَ، عَارِفًا مِمَّنْ تَعَلَّمْتَ.</p>
              {video && (
              <div className={styles.videoContainer}>
<iframe width="531" height="398" src="https://www.youtube.com/embed/tDbYn21akQ8" title="أشعر بالظلم والاضطهاد ماذا أفعل  / سنوات مع أسئلة الناس/ البابا شنودة الثالث" frameBorder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerPolicy="strict-origin-when-cross-origin" allowFullScreen></iframe>              </div>
            )}
          </div>
        );
          case 'page8':
          return (
            <div className={styles.pageContent}>
              <h1>عند شعورك بالألم </h1>
              <h2>(أيوب17:5-19)</h2>
              <p>17 « هُوَذَا طُوبَى لِرَجُل يُؤَدِّبُهُ اللهُ. فَلاَ تَرْفُضْ تَأْدِيبَ الْقَدِيرِ. 18 لأَنَّهُ هُوَ يَجْرَحُ وَيَعْصِبُ. يَسْحَقُ وَيَدَاهُ تَشْفِيَانِ. 19 فِي سِتِّ شَدَائِدَ يُنَجِّيكَ، وَفِي سَبْعٍ لاَ يَمَسُّكَ سُوءٌ.</p>
              <h3>(1بطرس18:2-25)</h3>
              <p>18 أَيُّهَا الْخُدَّامُ، كُونُوا خَاضِعِينَ بِكُلِّ هَيْبَةٍ لِلسَّادَةِ، لَيْسَ لِلصَّالِحِينَ الْمُتَرَفِّقِينَ فَقَطْ، بَلْ لِلْعُنَفَاءِ أَيْضًا. 19 لأَنَّ هذَا فَضْلٌ، إِنْ كَانَ أَحَدٌ مِنْ أَجْلِ ضَمِيرٍ نَحْوَ اللهِ، يَحْتَمِلُ أَحْزَانًا مُتَأَلِّمًا بِالظُّلْمِ. 20 لأَنَّهُ أَيُّ مَجْدٍ هُوَ إِنْ كُنْتُمْ تُلْطَمُونَ مُخْطِئِينَ فَتَصْبِرُونَ؟ بَلْ إِنْ كُنْتُمْ تَتَأَلَّمُونَ عَامِلِينَ الْخَيْرَ فَتَصْبِرُونَ، فَهذَا فَضْلٌ عِنْدَ اللهِ، 21 لأَنَّكُمْ لِهذَا دُعِيتُمْ. فَإِنَّ الْمَسِيحَ أَيْضًا تَأَلَّمَ لأَجْلِنَا، تَارِكًا لَنَا مِثَالاً لِكَيْ تَتَّبِعُوا خُطُوَاتِهِ. 22 «الَّذِي لَمْ يَفْعَلْ خَطِيَّةً، وَلاَ وُجِدَ فِي فَمِهِ مَكْرٌ»، 23 الَّذِي إِذْ شُتِمَ لَمْ يَكُنْ يَشْتِمُ عِوَضًا، وَإِذْ تَأَلَّمَ لَمْ يَكُنْ يُهَدِّدُ بَلْ كَانَ يُسَلِّمُ لِمَنْ يَقْضِي بِعَدْل. 24 الَّذِي حَمَلَ هُوَ نَفْسُهُ خَطَايَانَا فِي جَسَدِهِ عَلَى الْخَشَبَةِ، لِكَيْ نَمُوتَ عَنِ الْخَطَايَا فَنَحْيَا لِلْبِرِّ. الَّذِي بِجَلْدَتِهِ شُفِيتُمْ. 25 لأَنَّكُمْ كُنْتُمْ كَخِرَافٍ ضَالَّةٍ، لكِنَّكُمْ رَجَعْتُمُ الآنَ إِلَى رَاعِي نُفُوسِكُمْ وَأُسْقُفِهَا.</p>
              {video && (
              <div className={styles.videoContainer}>
<iframe width="708" height="398" src="https://www.youtube.com/embed/XoVYdwdBYYo" title="ليه الوجع ؟ لماذا الألم ؟ ليه الجرح ؟ - تأمل قصير - أبونا داود لمعي" frameBorder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerPolicy="strict-origin-when-cross-origin" allowFullScreen></iframe>              </div>
            )}
          </div>
        );
          case 'page9':
          return (
            <div className={styles.pageContent}>
              <h1>عند شعورك بالحزن</h1>
              <h2>(مزمور116)</h2>
              <p>1 أَحْبَبْتُ لأَنَّ الرَّبَّ يَسْمَعُ صَوْتِي، تَضَرُّعَاتِي. 2 لأَنَّهُ أَمَالَ أُذْنَهُ إِلَيَّ فَأَدْعُوهُ مُدَّةَ حَيَاتِي. 3 اكْتَنَفَتْنِي حِبَالُ الْمَوْتِ. أَصَابَتْنِي شَدَائِدُ الْهَاوِيَةِ. كَابَدْتُ ضِيقًا وَحُزْنًا. 4 وَبِاسْمِ الرَّبِّ دَعَوْتُ: «آهِ يَا رَبُّ، نَجِّ نَفْسِي!». 5 الرَّبُّ حَنَّانٌ وَصِدِّيقٌ، وَإِلهُنَا رَحِيمٌ. 6 الرَّبُّ حَافِظُ الْبُسَطَاءِ. تَذَلَّلْتُ فَخَلَّصَنِي. 7 ارْجِعِي يَا نَفْسِي إِلَى رَاحَتِكِ، لأَنَّ الرَّبَّ قَدْ أَحْسَنَ إِلَيْكِ. 8 لأَنَّكَ أَنْقَذْتَ نَفْسِي مِنَ الْمَوْتِ، وَعَيْنِي مِنَ الدَّمْعَةِ، وَرِجْلَيَّ مِنَ الزَّلَقِ. 9 أَسْلُكُ قُدَّامَ الرَّبِّ فِي أَرْضِ الأَحْيَاءِ.

10 آمَنْتُ لِذلِكَ تَكَلَّمْتُ: «أَنَا تَذَلَّلْتُ جِدًّا». 11 أَنَا قُلْتُ فِي حَيْرَتِي: «كُلُّ إِنْسَانٍ كَاذِبٌ». 12 مَاذَا أَرُدُّ لِلرَّبِّ مِنْ أَجْلِ كُلِّ حَسَنَاتِهِ لِي؟ 13 كَأْسَ الْخَلاَصِ أَتَنَاوَلُ، وَبِاسْمِ الرَّبِّ أَدْعُو. 14 أُوفِي نُذُورِي لِلرَّبِّ مُقَابِلَ كُلِّ شَعْبِهِ.

15 عَزِيزٌ فِي عَيْنَيِ الرَّبِّ مَوْتُ أَتْقِيَائِهِ. 16 آهِ يَا رَبُّ، لأَنِّي عَبْدُكَ! أَنَا عَبْدُكَ ابْنُ أَمَتِكَ. حَلَلْتَ قُيُودِي. 17 فَلَكَ أَذْبَحُ ذَبِيحَةَ حَمْدٍ، وَبِاسْمِ الرَّبِّ أَدْعُو. 18 أُوفِي نُذُورِي لِلرَّبِّ مُقَابِلَ شَعْبِهِ، 19 فِي دِيَارِ بَيْتِ الرَّبِّ، فِي وَسَطِكِ يَا أُورُشَلِيمُ. هَلِّلُويَا.</p>
<h3>(1تسالونيكي13:4-18)</h3>
<p>13 ثُمَّ لاَ أُرِيدُ أَنْ تَجْهَلُوا أَيُّهَا الإِخْوَةُ مِنْ جِهَةِ الرَّاقِدِينَ، لِكَيْ لاَ تَحْزَنُوا كَالْبَاقِينَ الَّذِينَ لاَ رَجَاءَ لَهُمْ. 14 لأَنَّهُ إِنْ كُنَّا نُؤْمِنُ أَنَّ يَسُوعَ مَاتَ وَقَامَ، فَكَذلِكَ الرَّاقِدُونَ بِيَسُوعَ، سَيُحْضِرُهُمُ اللهُ أَيْضًا مَعَهُ. 15 فَإِنَّنَا نَقُولُ لَكُمْ هذَا بِكَلِمَةِ الرَّبِّ: إِنَّنَا نَحْنُ الأَحْيَاءَ الْبَاقِينَ إِلَى مَجِيءِ الرَّبِّ، لاَ نَسْبِقُ الرَّاقِدِينَ. 16 لأَنَّ الرَّبّ نََفْسَهُ بِهُتَافٍ، بِصَوْتِ رَئِيسِ مَلاَئِكَةٍ وَبُوقِ اللهِ، سَوْفَ يَنْزِلُ مِنَ السَّمَاءِ وَالأَمْوَاتُ فِي الْمَسِيحِ سَيَقُومُونَ أَوَّلاً. 17 ثُمَّ نَحْنُ الأَحْيَاءَ الْبَاقِينَ سَنُخْطَفُ جَمِيعًا مَعَهُمْ فِي السُّحُبِ لِمُلاَقَاةِ الرَّبِّ فِي الْهَوَاءِ، وَهكَذَا نَكُونُ كُلَّ حِينٍ مَعَ الرَّبِّ. 18 لِذلِكَ عَزُّوا بَعْضُكُمْ بَعْضًا بِهذَا الْكَلاَمِ.</p>
{video && (
              <div className={styles.videoContainer}>
<iframe width="708" height="398" src="https://www.youtube.com/embed/gs3FB80S45o" title="الحزن - ابونا بولس جورج - عظة اجتماع السيدات - الاربعاء 3 ابريل 2024" frameBorder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerPolicy="strict-origin-when-cross-origin" allowFullScreen></iframe>             </div>
            )}
          </div>
        );
          case 'page10':
          return (
            <div className={styles.pageContent}>
              <h1>عند شعورك بالغضب</h1>
              <h2>(مزمور1:4-4)</h2>
              <p>1 عِنْدَ دُعَائِيَ اسْتَجِبْ لِي يَا إِلهَ بِرِّي. فِي الضِّيقِ رَحَّبْتَ لِي. تَرَاءَفْ عَلَيَّ وَاسْمَعْ صَلاَتِي. 2 يَا بَنِي الْبَشَرِ، حَتَّى مَتَى يَكُونُ مَجْدِي عَارًا؟ حَتَّى مَتَى تُحِبُّونَ الْبَاطِلَ وَتَبْتَغُونَ الْكَذِبَ؟ سِلاَهْ. 3 فَاعْلَمُوا أَنَّ الرَّبَّ قَدْ مَيَّزَ تَقِيَّهُ. الرَّبُّ يَسْمَعُ عِنْدَ مَا أَدْعُوهُ. 4 اِرْتَعِدُوا وَلاَ تُخْطِئُوا. تَكَلَّمُوا فِي قُلُوبِكُمْ عَلَى مَضَاجِعِكُمْ وَاسْكُتُوا. سِلاَهْ.</p>
              <h3>(أفسس26:4-32)</h3>
              <p>اِغْضَبُوا وَلاَ تُخْطِئُوا. لاَ تَغْرُبِ الشَّمْسُ عَلَى غَيْظِكُمْ، 27 وَلاَ تُعْطُوا إِبْلِيسَ مَكَانًا. 28 لاَ يَسْرِقِ السَّارِقُ فِي مَا بَعْدُ، بَلْ بِالْحَرِيِّ يَتْعَبُ عَامِلاً الصَّالِحَ بِيَدَيْهِ، لِيَكُونَ لَهُ أَنْ يُعْطِيَ مَنْ لَهُ احْتِيَاجٌ. 29 لاَ تَخْرُجْ كَلِمَةٌ رَدِيَّةٌ مِنْ أَفْوَاهِكُمْ، بَلْ كُلُّ مَا كَانَ صَالِحًا لِلْبُنْيَانِ، حَسَبَ الْحَاجَةِ، كَيْ يُعْطِيَ نِعْمَةً لِلسَّامِعِينَ. 30 وَلاَ تُحْزِنُوا رُوحَ اللهِ الْقُدُّوسَ الَّذِي بِهِ خُتِمْتُمْ لِيَوْمِ الْفِدَاءِ. 31 لِيُرْفَعْ مِنْ بَيْنِكُمْ كُلُّ مَرَارَةٍ وَسَخَطٍ وَغَضَبٍ وَصِيَاحٍ وَتَجْدِيفٍ مَعَ كُلِّ خُبْثٍ. 32 وَكُونُوا لُطَفَاءَ بَعْضُكُمْ نَحْوَ بَعْضٍ، شَفُوقِينَ مُتَسَامِحِينَ كَمَا سَامَحَكُمُ اللهُ أَيْضًا فِي الْمَسِيحِ.</p>
              {video && (
              <div className={styles.videoContainer}>
<iframe width="531" height="398" src="https://www.youtube.com/embed/0lexyZTGl3Y" title="تامل رائع عن الغضب وعلاجة  لمثلث الرحمات البابا شنودة الثالث بالموسيقى @ اعداد/ عادل عبدالله" frameBorder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerPolicy="strict-origin-when-cross-origin" allowFullScreen></iframe>      </div>
            )}
          </div>
        );
          case 'page11':
          return (
            <div className={styles.pageContent}>
              <h1>عند شعورك بالحقد</h1>
              <h2>(مزمور1:109-5)</h2>
              <p>1 يَا إِلهَ تَسْبِيحِي لاَ تَسْكُتْ، 2 لأَنَّهُ قَدِ انْفَتَحَ عَلَيَّ فَمُ الشِّرِّيرِ وَفَمُ الْغِشِّ. تَكَلَّمُوا مَعِي بِلِسَانِ كِذْبٍ، 3 بِكَلاَمِ بُغْضٍ أَحَاطُوا بِي، وَقَاتَلُونِي بِلاَ سَبَبٍ. 4 بَدَلَ مَحَبَّتِي يُخَاصِمُونَنِي. أَمَّا أَنَا فَصَلاَةٌ. 5 وَضَعُوا عَلَيَّ شَرًّا بَدَلَ خَيْرٍ، وَبُغْضًا بَدَلَ حُبِّي.</p>
              <h3>(متى38:5-48)</h3>
              <p>38 «سَمِعْتُمْ أَنَّهُ قِيلَ: عَيْنٌ بِعَيْنٍ وَسِنٌّ بِسِنٍّ. 39 وَأَمَّا أَنَا فَأَقُولُ لَكُمْ: لاَ تُقَاوِمُوا الشَّرَّ، بَلْ مَنْ لَطَمَكَ عَلَى خَدِّكَ الأَيْمَنِ فَحَوِّلْ لَهُ الآخَرَ أَيْضًا. 40 وَمَنْ أَرَادَ أَنْ يُخَاصِمَكَ وَيَأْخُذَ ثَوْبَكَ فَاتْرُكْ لَهُ الرِّدَاءَ أَيْضًا. 41 وَمَنْ سَخَّرَكَ مِيلاً وَاحِدًا فَاذْهَبْ مَعَهُ اثْنَيْنِ. 42 مَنْ سَأَلَكَ فَأَعْطِهِ، وَمَنْ أَرَادَ أَنْ يَقْتَرِضَ مِنْكَ فَلاَ تَرُدَّهُ.

43 «سَمِعْتُمْ أَنَّهُ قِيلَ: تُحِبُّ قَرِيبَكَ وَتُبْغِضُ عَدُوَّكَ. 44 وَأَمَّا أَنَا فَأَقُولُ لَكُمْ: أَحِبُّوا أَعْدَاءَكُمْ. بَارِكُوا لاَعِنِيكُمْ. أَحْسِنُوا إِلَى مُبْغِضِيكُمْ، وَصَلُّوا لأَجْلِ الَّذِينَ يُسِيئُونَ إِلَيْكُمْ وَيَطْرُدُونَكُمْ، 45 لِكَيْ تَكُونُوا أَبْنَاءَ أَبِيكُمُ الَّذِي فِي السَّمَاوَاتِ، فَإِنَّهُ يُشْرِقُ شَمْسَهُ عَلَى الأَشْرَارِ وَالصَّالِحِينَ، وَيُمْطِرُ عَلَى الأَبْرَارِ وَالظَّالِمِينَ. 46 لأَنَّهُ إِنْ أَحْبَبْتُمُ الَّذِينَ يُحِبُّونَكُمْ، فَأَيُّ أَجْرٍ لَكُمْ؟ أَلَيْسَ الْعَشَّارُونَ أَيْضًا يَفْعَلُونَ ذلِكَ؟ 47 وَإِنْ سَلَّمْتُمْ عَلَى إِخْوَتِكُمْ فَقَطْ، فَأَيَّ فَضْل تَصْنَعُونَ؟ أَلَيْسَ الْعَشَّارُونَ أَيْضًا يَفْعَلُونَ هكَذَا؟ 48 فَكُونُوا أَنْتُمْ كَامِلِينَ كَمَا أَنَّ أَبَاكُمُ الَّذِي فِي السَّمَاوَاتِ هُوَ كَامِلٌ.</p>
{video && (
              <div className={styles.videoContainer}>
<iframe width="708" height="398" src="https://www.youtube.com/embed/zw4wwUVd4Qs" title="الحلقة السادسة - الغيرة والحسد- من سلسلة حلقات ( أنا تعبان ) لأبونا الحبيب القمص داود لمعي" frameBorder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerPolicy="strict-origin-when-cross-origin" allowFullScreen></iframe>             </div>
            )}
          </div>
        );
          case 'page12':
          return (
            <div className={styles.pageContent}>
              <h1>عند شعورك بالاحتياج</h1>
              <h2>(مزمور63)</h2>
              <p>1 يَا اَللهُ، إِلهِي أَنْتَ. إِلَيْكَ أُبَكِّرُ. عَطِشَتْ إِلَيْكَ نَفْسِي، يَشْتَاقُ إِلَيْكَ جَسَدِي فِي أَرْضٍ نَاشِفَةٍ وَيَابِسَةٍ بِلاَ مَاءٍ، 2 لِكَيْ أُبْصِرَ قُوَّتَكَ وَمَجْدَكَ. كَمَا قَدْ رَأَيْتُكَ فِي قُدْسِكَ. 3 لأَنَّ رَحْمَتَكَ أَفْضَلُ مِنَ الْحَيَاةِ. شَفَتَايَ تُسَبِّحَانِكَ. 4 هكَذَا أُبَارِكُكَ فِي حَيَاتِي. بِاسْمِكَ أَرْفَعُ يَدَيَّ. 5 كَمَا مِنْ شَحْمٍ وَدَسَمٍ تَشْبَعُ نَفْسِي، وَبِشَفَتَيْ الابْتِهَاجِ يُسَبِّحُكَ فَمِي. 6 إِذَا ذَكَرْتُكَ عَلَى فِرَاشِي، فِي السُّهْدِ أَلْهَجُ بِكَ، 7 لأَنَّكَ كُنْتَ عَوْنًا لِي، وَبِظِلِّ جَنَاحَيْكَ أَبْتَهِجُ.

8 اِلْتَصَقَتْ نَفْسِي بِكَ. يَمِينُكَ تَعْضُدُنِي. 9 أَمَّا الَّذِينَ هُمْ لِلتَّهْلُكَةِ يَطْلُبُونَ نَفْسِي، فَيَدْخُلُونَ فِي أَسَافِلِ الأَرْضِ. 10 يُدْفَعُونَ إِلَى يَدَيِ السَّيْفِ. يَكُونُونَ نَصِيبًا لِبَنَاتِ آوَى. 11 أَمَّا الْمَلِكُ فَيَفْرَحُ بِاللهِ. يَفْتَخِرُ كُلُّ مَنْ يَحْلِفُ بِهِ، لأَنَّ أَفْوَاهَ الْمُتَكَلِّمِينَ بِالْكَذِبِ تُسَدُّ.</p>
<h3>(لوقا22:12-31)</h3>
<p>22 وَقَالَ لِتَلاَمِيذِهِ:«مِنْ أَجْلِ هذَا أَقُولُ لَكُمْ: لاَ تَهْتَمُّوا لِحَيَاتِكُمْ بِمَا تَأْكُلُونَ، وَلاَ لِلْجَسَدِ بِمَا تَلْبَسُونَ. 23 اَلْحَيَاةُ أَفْضَلُ مِنَ الطَّعَامِ، وَالْجَسَدُ أَفْضَلُ مِنَ اللِّبَاسِ. 24 تَأَمَّلُوا الْغِرْبَانَ: أَنَّهَا لاَ تَزْرَعُ وَلاَ تَحْصُدُ، وَلَيْسَ لَهَا مَخْدَعٌ وَلاَ مَخْزَنٌ، وَاللهُ يُقِيتُهَا. كَمْ أَنْتُمْ بِالْحَرِيِّ أَفْضَلُ مِنَ الطُّيُورِ! 25 وَمَنْ مِنْكُمْ إِذَا اهْتَمَّ يَقْدِرُ أَنْ يَزِيدَ عَلَى قَامَتِهِ ذِرَاعًا وَاحِدَةً؟ 26 فَإِنْ كُنْتُمْ لاَ تَقْدِرُونَ وَلاَ عَلَى الأَصْغَرِ، فَلِمَاذَا تَهْتَمُّونَ بِالْبَوَاقِي؟ 27 تَأَمَّلُوا الزَّنَابِقَ كَيْفَ تَنْمُو: لاَ تَتْعَبُ وَلاَ تَغْزِلُ، وَلكِنْ أَقُولُ لَكُمْ: إِنَّهُ وَلاَ سُلَيْمَانُ فِي كُلِّ مَجْدِهِ كَانَ يَلْبَسُ كَوَاحِدَةٍ مِنْهَا. 28 فَإِنْ كَانَ الْعُشْبُ الَّذِي يُوجَدُ الْيَوْمَ فِي الْحَقْلِ وَيُطْرَحُ غَدًا فِي التَّنُّورِ يُلْبِسُهُ اللهُ هكَذَا، فَكَمْ بِالْحَرِيِّ يُلْبِسُكُمْ أَنْتُمْ يَا قَلِيلِي الإِيمَانِ؟ 29 فَلاَ تَطْلُبُوا أَنْتُمْ مَا تَأْكُلُونَ وَمَا تَشْرَبُونَ وَلاَ تَقْلَقُوا، 30 فَإِنَّ هذِهِ كُلَّهَا تَطْلُبُهَا أُمَمُ الْعَالَمِ. وَأَمَّا أَنْتُمْ فَأَبُوكُمْ يَعْلَمُ أَنَّكُمْ تَحْتَاجُونَ إِلَى هذِهِ. 31 بَلِ اطْلُبُوا مَلَكُوتَ اللهِ، وَهذِهِ كُلُّهَا تُزَادُ لَكُمْ.</p>
{video && (
              <div className={styles.videoContainer}>
<iframe width="708" height="398" src="https://www.youtube.com/embed/wmyIFpy5LLA" title="الاحتياج النفسي - الأب داود لمعي" frameBorder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerPolicy="strict-origin-when-cross-origin" allowFullScreen></iframe>             </div>
            )}
          </div>
        );
          case 'page13':
          return (
            <div className={styles.pageContent}>
              <h1>عند شعورك بالوحدة</h1>
              <h2>(مزمور15:25-21)</h2>
              <p>15 عَيْنَايَ دَائِمًا إِلَى الرَّبِّ، لأَنَّهُ هُوَ يُخْرِجُ رِجْلَيَّ مِنَ الشَّبَكَةِ.

16 اِلْتَفِتْ إِلَيَّ وَارْحَمْنِي، لأَنِّي وَحْدٌ وَمِسْكِينٌ أَنَا. 17 اُفْرُجْ ضِيقَاتِ قَلْبِي. مِنْ شَدَائِدِي أَخْرِجْنِي. 18 انْظُرْ إِلَى ذُلِّي وَتَعَبِي، وَاغْفِرْ جَمِيعَ خَطَايَايَ. 19 انْظُرْ إِلَى أَعْدَائِي لأَنَّهُمْ قَدْ كَثُرُوا، وَبُغْضًا ظُلْمًا أَبْغَضُونِي. 20 احْفَظْ نَفْسِي وَأَنْقِذْنِي. لاَ أُخْزَى لأَنِّي عَلَيْكَ تَوَكَّلْتُ. 21 يَحْفَظُنِي الْكَمَالُ وَالاسْتِقَامَةُ، لأَنِّي انْتَظَرْتُكَ.</p>
<h3>(يوحنا15:14-31)</h3>
<p>15 «إِنْ كُنْتُمْ تُحِبُّونَنِي فَاحْفَظُوا وَصَايَايَ، 16 وَأَنَا أَطْلُبُ مِنَ الآبِ فَيُعْطِيكُمْ مُعَزِّيًا آخَرَ لِيَمْكُثَ مَعَكُمْ إِلَى الأَبَدِ، 17 رُوحُ الْحَقِّ الَّذِي لاَ يَسْتَطِيعُ الْعَالَمُ أَنْ يَقْبَلَهُ، لأَنَّهُ لاَ يَرَاهُ وَلاَ يَعْرِفُهُ، وَأَمَّا أَنْتُمْ فَتَعْرِفُونَهُ لأَنَّهُ مَاكِثٌ مَعَكُمْ وَيَكُونُ فِيكُمْ. 18 لاَ أَتْرُكُكُمْ يَتَامَى. إِنِّي آتِي إِلَيْكُمْ. 19 بَعْدَ قَلِيل لاَ يَرَانِي الْعَالَمُ أَيْضًا، وَأَمَّا أَنْتُمْ فَتَرَوْنَنِي. إِنِّي أَنَا حَيٌّ فَأَنْتُمْ سَتَحْيَوْنَ. 20 فِي ذلِكَ الْيَوْمِ تَعْلَمُونَ أَنِّي أَنَا فِي أَبِي، وَأَنْتُمْ فِيَّ، وَأَنَا فِيكُمْ. 21 اَلَّذِي عِنْدَهُ وَصَايَايَ وَيَحْفَظُهَا فَهُوَ الَّذِي يُحِبُّنِي، وَالَّذِي يُحِبُّنِي يُحِبُّهُ أَبِي، وَأَنَا أُحِبُّهُ، وَأُظْهِرُ لَهُ ذَاتِي».

22 قَالَ لَهُ يَهُوذَا لَيْسَ الإِسْخَرْيُوطِيَّ:«يَا سَيِّدُ، مَاذَا حَدَثَ حَتَّى إِنَّكَ مُزْمِعٌ أَنْ تُظْهِرَ ذَاتَكَ لَنَا وَلَيْسَ لِلْعَالَمِ؟» 23 أَجَابَ يَسُوعُ وَقَالَ لَهُ:«إِنْ أَحَبَّنِي أَحَدٌ يَحْفَظْ كَلاَمِي، وَيُحِبُّهُ أَبِي، وَإِلَيْهِ نَأْتِي، وَعِنْدَهُ نَصْنَعُ مَنْزِلاً. 24 اَلَّذِي لاَ يُحِبُّنِي لاَ يَحْفَظُ كَلاَمِي. وَالْكَلاَمُ الَّذِي تَسْمَعُونَهُ لَيْسَ لِي بَلْ لِلآبِ الَّذِي أَرْسَلَنِي. 25 بِهذَا كَلَّمْتُكُمْ وَأَنَا عِنْدَكُمْ. 26 وَأَمَّا الْمُعَزِّي، الرُّوحُ الْقُدُسُ، الَّذِي سَيُرْسِلُهُ الآبُ بِاسْمِي، فَهُوَ يُعَلِّمُكُمْ كُلَّ شَيْءٍ، وَيُذَكِّرُكُمْ بِكُلِّ مَا قُلْتُهُ لَكُمْ.

27 «سَلاَمًا أَتْرُكُ لَكُمْ. سَلاَمِي أُعْطِيكُمْ. لَيْسَ كَمَا يُعْطِي الْعَالَمُ أُعْطِيكُمْ أَنَا. لاَ تَضْطَرِبْ قُلُوبُكُمْ وَلاَ تَرْهَبْ. 28 سَمِعْتُمْ أَنِّي قُلْتُ لَكُمْ: أَنَا أَذْهَبُ ثُمَّ آتِي إِلَيْكُمْ. لَوْ كُنْتُمْ تُحِبُّونَنِي لَكُنْتُمْ تَفْرَحُونَ لأَنِّي قُلْتُ أَمْضِي إِلَى الآبِ، لأَنَّ أَبِي أَعْظَمُ مِنِّي. 29 وَقُلْتُ لَكُمُ الآنَ قَبْلَ أَنْ يَكُونَ، حَتَّى مَتَى كَانَ تُؤْمِنُونَ. 30 لاَ أَتَكَلَّمُ أَيْضًا مَعَكُمْ كَثِيرًا، لأَنَّ رَئِيسَ هذَا الْعَالَمِ يَأْتِي وَلَيْسَ لَهُ فِيَّ شَيْءٌ. 31 وَلكِنْ لِيَفْهَمَ الْعَالَمُ أَنِّي أُحِبُّ الآبَ، وَكَمَا أَوْصَانِي الآبُ هكَذَا أَفْعَلُ. قُومُوا نَنْطَلِقْ مِنْ ههُنَا.</p>
{video && (
              <div className={styles.videoContainer}>
<iframe width="708" height="398" src="https://www.youtube.com/embed/CGCov8QjFWE" title="عظة &quot;الشعور بالوحدة&quot; - الانبا كاراس اسقف المحلة الكبرى بدون موسيقى" frameBorder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerPolicy="strict-origin-when-cross-origin" allowFullScreen></iframe>     </div>
            )}
          </div>
        );
          case 'page14':
            return (
              <div className={styles.pageContent}>
                <h1>عند شعورك بخيبة الأمل</h1>
                <h2>(مزمور118)</h2>
                <p>1 اِحْمَدُوا الرَّبَّ لأَنَّهُ صَالِحٌ، لأَنَّ إِلَى الأَبَدِ رَحْمَتَهُ. 2 لِيَقُلْ إِسْرَائِيلُ: «إِنَّ إِلَى الأَبَدِ رَحْمَتَهُ». 3 لِيَقُلْ بَيْتُ هَارُونَ: «إِنَّ إِلَى الأَبَدِ رَحْمَتَهُ». 4 لِيَقُلْ مُتَّقُو الرَّبِّ: «إِنَّ إِلَى الأَبَدِ رَحْمَتَهُ».

5 مِنَ الضِّيقِ دَعَوْتُ الرَّبَّ فَأَجَابَنِي مِنَ الرُّحْبِ. 6 الرَّبُّ لِي فَلاَ أَخَافُ. مَاذَا يَصْنَعُ بِي الإِنْسَانُ؟ 7 الرَّبُّ لِي بَيْنَ مُعِينِيَّ، وَأَنَا سَأَرَى بِأَعْدَائِي. 8 الاحْتِمَاءُ بِالرَّبِّ خَيْرٌ مِنَ التَّوَكُّلِ عَلَى إِنْسَانٍ. 9 الاحْتِمَاءُ بِالرَّبِّ خَيْرٌ مِنَ التَّوَكُّلِ عَلَى الرُّؤَسَاءِ. 10 كُلُّ الأُمَمِ أَحَاطُوا بِي. بِاسْمِ الرَّبِّ أُبِيدُهُمْ. 11 أَحَاطُوا بِي وَاكْتَنَفُونِي. بِاسْمِ الرَّبِّ أُبِيدُهُمْ. 12 أَحَاطُوا بِي مِثْلَ النَّحْلِ. انْطَفَأُوا كَنَارِ الشَّوْكِ. بِاسْمِ الرَّبِّ أُبِيدُهُمْ. 13 دَحَرْتَنِي دُحُورًا لأَسْقُطَ، أَمَّا الرَّبُّ فَعَضَدَنِي. 14 قُوَّتِي وَتَرَنُّمِي الرَّبُّ، وَقَدْ صَارَ لِي خَلاَصًا. 15 صَوْتُ تَرَنُّمٍ وَخَلاَصٍ فِي خِيَامِ الصِّدِّيقِينَ: «يَمِينُ الرَّبِّ صَانِعَةٌ بِبَأْسٍ. 16 يَمِينُ الرَّبِّ مُرْتَفِعَةٌ. يَمِينُ الرَّبِّ صَانِعَةٌ بِبَأْسٍ». 17 لاَ أَمُوتُ بَلْ أَحْيَا وَأُحَدِّثُ بِأَعْمَالِ الرَّبِّ. 18 تَأْدِيبًا أَدَّبَنِي الرَّبُّ، وَإِلَى الْمَوْتِ لَمْ يُسْلِمْنِي.

19 اِفْتَحُوا لِي أَبْوَابَ الْبِرِّ. أَدْخُلْ فِيهَا وَأَحْمَدِ الرَّبَّ. 20 هذَا الْبَابُ لِلرَّبِّ. الصِّدِّيقُونَ يَدْخُلُونَ فِيهِ. 21 أَحْمَدُكَ لأَنَّكَ اسْتَجَبْتَ لِي وَصِرْتَ لِي خَلاَصًا. 22 الْحَجَرُ الَّذِي رَفَضَهُ الْبَنَّاؤُونَ قَدْ صَارَ رَأْسَ الزَّاوِيَةِ. 23 مِنْ قِبَلِ الرَّبِّ كَانَ هذَا، وَهُوَ عَجِيبٌ فِي أَعْيُنِنَا.

24 هذَا هُوَ الْيَوْمُ الَّذِي صَنَعُهُ الرَّبُّ، نَبْتَهِجُ وَنَفْرَحُ فِيهِ. 25 آهِ يَا رَبُّ خَلِّصْ! آهِ يَا رَبُّ أَنْقِذْ! 26 مُبَارَكٌ الآتِي بِاسْمِ الرَّبِّ. بَارَكْنَاكُمْ مِنْ بَيْتِ الرَّبِّ. 27 الرَّبُّ هُوَ اللهُ وَقَدْ أَنَارَ لَنَا. أَوْثِقُوا الذَّبِيحَةَ بِرُبُطٍ إِلَى قُرُونِ الْمَذْبَحِ. 28 إِلهِي أَنْتَ فَأَحْمَدُكَ، إِلهِي فَأَرْفَعُكَ. 29 احْمَدُوا الرَّبَّ لأَنَّهُ صَالِحٌ، لأَنَّ إِلَى الأَبَدِ رَحْمَتَهُ.</p>
<h3>(مرقس21:9-24)</h3>
                <p>21 فَسَأَلَ أَبَاهُ:«كَمْ مِنَ الزَّمَانِ مُنْذُ أَصَابَهُ هذَا؟» فَقَالَ: «مُنْذُ صِبَاهُ. 22 وَكَثِيرًا مَا أَلْقَاهُ فِي النَّارِ وَفِي الْمَاءِ لِيُهْلِكَهُ. لكِنْ إِنْ كُنْتَ تَسْتَطِيعُ شَيْئًا فَتَحَنَّنْ عَلَيْنَا وَأَعِنَّا». 23 فَقَالَ لَهُ يَسُوعُ:«إِنْ كُنْتَ تَسْتَطِيعُ أَنْ تُؤْمِنَ. كُلُّ شَيْءٍ مُسْتَطَاعٌ لِلْمُؤْمِنِ». 24 فَلِلْوَقْتِ صَرَخَ أَبُو الْوَلَدِ بِدُمُوعٍ وَقَالَ:«أُومِنُ يَا سَيِّدُ، فَأَعِنْ عَدَمَ إِيمَانِي».</p>
                {video && (
              <div className={styles.videoContainer}>
<iframe width="531" height="398" src="https://www.youtube.com/embed/-nMHxHrcY3g" title="كلمة صغيرة من ابونا داود لمعي عن فقدان الامل" frameBorder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerPolicy="strict-origin-when-cross-origin" allowFullScreen></iframe>  </div>
            )}
          </div>
        );
            case 'page15':
            return (
              <div className={styles.pageContent}>
                <h1>عند شعورك بالفشل</h1>
                <h2>(مزمور31)</h2>
                <p>1 عَلَيْكَ يَا رَبُّ تَوَكَّلْتُ. لاَ تَدَعْنِي أَخْزَى مَدَى الدَّهْرِ. بِعَدْلِكَ نَجِّنِي. 2 أَمِلْ إِلَيَّ أُذُنَكَ. سَرِيعًا أَنْقِذْنِي. كُنْ لِي صَخْرَةَ حِصْنٍ، بَيْتَ مَلْجَإٍ لِتَخْلِيصِي. 3 لأَنَّ صَخْرَتِي وَمَعْقِلِي أَنْتَ. مِنْ أَجْلِ اسْمِكَ تَهْدِينِي وَتَقُودُنِي. 4 أَخْرِجْنِي مِنَ الشَّبَكَةِ الَّتِي خَبَّأُوهَا لِي، لأَنَّكَ أَنْتَ حِصْنِي. 5 فِي يَدِكَ أَسْتَوْدِعُ رُوحِي. فَدَيْتَنِي يَا رَبُّ إِلهَ الْحَقِّ. 6 أَبْغَضْتُ الَّذِينَ يُرَاعُونَ أَبَاطِيلَ كَاذِبَةً. أَمَّا أَنَا فَعَلَى الرَّبِّ تَوَكَّلْتُ. 7 أَبْتَهِجُ وَأَفْرَحُ بِرَحْمَتِكَ، لأَنَّكَ نَظَرْتَ إِلَى مَذَلَّتِي، وَعَرَفْتَ فِي الشَّدَائِدِ نَفْسِي، 8 وَلَمْ تَحْبِسْنِي فِي يَدِ الْعَدُوِّ، بَلْ أَقَمْتَ فِي الرَُّحْبِ رِجْلِي.

9 اِرْحَمْنِي يَا رَبُّ لأَنِّي فِي ضِيْق. خَسَفَتْ مِنَ الْغَمِّ عَيْنِي. نَفْسِي وَبَطْنِي. 10 لأَنَّ حَيَاتِي قَدْ فَنِيَتْ بِالْحُزْنِ، وَسِنِينِي بِالتَّنَهُّدِ. ضَعُفَتْ بِشَقَاوَتِي قُوَّتِي، وَبَلِيَتْ عِظَامِي. 11 عِنْدَ كُلِّ أَعْدَائِي صِرْتُ عَارًا، وَعِنْدَ جِيرَانِي بِالْكُلِّيَّةِ، وَرُعْبًا لِمَعَارِفِي. الَّذِينَ رَأَوْنِي خَارِجًا هَرَبُوا عَنِّي. 12 نُسِيتُ مِنَ الْقَلْبِ مِثْلَ الْمَيْتِ. صِرْتُ مِثْلَ إِنَاءٍ مُتْلَفٍ. 13 لأَنِّي سَمِعْتُ مَذَمَّةً مِنْ كَثِيرِينَ. الْخَوْفُ مُسْتَدِيرٌ بِي بِمُؤَامَرَتِهِمْ مَعًا عَلَيَّ. تَفَكَّرُوا فِي أَخْذِ نَفْسِي.

14 أَمَّا أَنَا فَعَلَيْكَ تَوَكَّلْتُ يَا رَبُّ. قُلْتُ: «إِلهِي أَنْتَ». 15 فِي يَدِكَ آجَالِي. نَجِّنِي مِنْ يَدِ أَعْدَائِي وَمِنَ الَّذِينَ يَطْرُدُونَنِي. 16 أَضِئْ بِوَجْهِكَ عَلَى عَبْدِكَ. خَلِّصْنِي بِرَحْمَتِكَ. 17 يَا رَبُّ، لاَ تَدَعْنِي أَخْزَى لأَنِّي دَعَوْتُكَ. لِيَخْزَ الأَشْرَارُ. لِيَسْكُتُوا فِي الْهَاوِيَةِ. 18 لِتُبْكَمْ شِفَاهُ الْكَذِبِ، الْمُتَكَلِّمَةُ عَلَى الصِّدِّيقِ بِوَقَاحَةٍ، بِكِبْرِيَاءَ وَاسْتِهَانَةٍ.

19 مَا أَعْظَمَ جُودَكَ الَّذِي ذَخَرْتَهُ لِخَائِفِيكَ، وَفَعَلْتَهُ لِلْمُتَّكِلِينَ عَلَيْكَ تُجَاهَ بَنِي الْبَشَرِ! 20 تَسْتُرُهُمْ بِسِتْرِ وَجْهِكَ مِنْ مَكَايِدِ النَّاسِ. تُخْفِيهِمْ فِي مَظَلَّةٍ مِنْ مُخَاصَمَةِ الأَلْسُنِ. 21 مُبَارَكٌ الرَّبُّ ، لأَنَّهُ قَدْ جَعَلَ عَجَبًا رَحْمَتَهُ لِيفِي مَدِينَةٍ مُحَصَّنَةٍ. 22 وَأَنَا قُلْتُ فِي حَيْرَتِي: «إِنِّي قَدِ انْقَطَعْتُ مِنْ قُدَّامِ عَيْنَيْكَ». وَلكِنَّكَ سَمِعْتَ صَوْتَ تَضَرُّعِي إِذْ صَرَخْتُ إِلَيْكَ.

23 أَحِبُّوا الرَّبَّ يَا جَمِيعَ أَتْقِيَائِهِ. الرَّبُّ حَافِظُ الأَمَانَةِ، وَمُجَازٍ بِكَِثْرَةٍ الْعَامِلَ بِالْكِبْرِيَاءِ. 24 لِتَتَشَدَّدْ وَلْتَتَشَجَّعْ قُلُوبُكُمْ، يَا جَمِيعَ الْمُنْتَظِرِينَ الرَّبَّ</p>
<h3>(2كورنثوس13:4-18)</h3>
                <p>13 فَإِذْ لَنَا رُوحُ الإِيمَانِ عَيْنُهُ، حَسَبَ الْمَكْتُوب:«آمَنْتُ لِذلِكَ تَكَلَّمْتُ»، نَحْنُ أَيْضًا نُؤْمِنُ وَلِذلِكَ نَتَكَلَّمُ أَيْضًا. 14 عَالِمِينَ أَنَّ الَّذِي أَقَامَ الرَّبَّ يَسُوعَ سَيُقِيمُنَا نَحْنُ أَيْضًا بِيَسُوعَ، وَيُحْضِرُنَا مَعَكُمْ. 15 لأَنَّ جَمِيعَ الأَشْيَاءِ هِيَ مِنْ أَجْلِكُمْ، لِكَيْ تَكُونَ النِّعْمَةُ وَهِيَ قَدْ كَثُرَتْ بِالأَكْثَرِينَ، تَزِيدُ الشُّكْرَ لِمَجْدِ اللهِ. 16 لِذلِكَ لاَ نَفْشَلُ، بَلْ وَإِنْ كَانَ إِنْسَانُنَا الْخَارِجُ يَفْنَى، فَالدَّاخِلُ يَتَجَدَّدُ يَوْمًا فَيَوْمًا. 17 لأَنَّ خِفَّةَ ضِيقَتِنَا الْوَقْتِيَّةَ تُنْشِئُ لَنَا أَكْثَرَ فَأَكْثَرَ ثِقَلَ مَجْدٍ أَبَدِيًّا. 18 وَنَحْنُ غَيْرُ نَاظِرِينَ إِلَى الأَشْيَاءِ الَّتِي تُرَى، بَلْ إِلَى الَّتِي لاَ تُرَى. لأَنَّ الَّتِي تُرَى وَقْتِيَّةٌ، وَأَمَّا الَّتِي لاَ تُرَى فَأَبَدِيَّةٌ.</p>
                {video && (
              <div className={styles.videoContainer}>
<iframe width="708" height="398" src="https://www.youtube.com/embed/37AZsGvQoUA" title="الفشل - سلسلة اطمّن - أبونا داود لمعي" frameBorder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerPolicy="strict-origin-when-cross-origin" allowFullScreen></iframe> </div>
            )}
          </div>
        );
            case 'page16':
            return (
              <div className={styles.pageContent}>
                <h1>عند شعورك بالخطر</h1>
                <h2>(مزمور91)</h2>
                <p>1 اَلسَّاكِنُ فِي سِتْرِ الْعَلِيِّ، فِي ظِلِّ الْقَدِيرِ يَبِيتُ. 2 أَقُولُ لِلرَّبِّ: «مَلْجَإِي وَحِصْنِي. إِلهِي فَأَتَّكِلُ عَلَيْهِ». 3 لأَنَّهُ يُنَجِّيكَ مِنْ فَخِّ الصَّيَّادِ وَمِنَ الْوَبَإِ الْخَطِرِ. 4 بِخَوَافِيهِ يُظَلِّلُكَ، وَتَحْتَ أَجْنِحَتِهِ تَحْتَمِي. تُرْسٌ وَمِجَنٌّ حَقُّهُ. 5 لاَ تَخْشَى مِنْ خَوْفِ اللَّيْلِ، وَلاَ مِنْ سَهْمٍ يَطِيرُ فِي النَّهَارِ، 6 وَلاَ مِنْ وَبَإٍ يَسْلُكُ فِي الدُّجَى، وَلاَ مِنْ هَلاَكٍ يُفْسِدُ فِي الظَّهِيرَةِ. 7 يَسْقُطُ عَنْ جَانِبِكَ أَلْفٌ، وَرِبْوَاتٌ عَنْ يَمِينِكَ. إِلَيْكَ لاَ يَقْرُبُ. 8 إِنَّمَا بِعَيْنَيْكَ تَنْظُرُ وَتَرَى مُجَازَاةَ الأَشْرَارِ.

9 لأَنَّكَ قُلْتَ: «أَنْتَ يَا رَبُّ مَلْجَإِي». جَعَلْتَ الْعَلِيَّ مَسْكَنَكَ، 10 لاَ يُلاَقِيكَ شَرٌّ، وَلاَ تَدْنُو ضَرْبَةٌ مِنْ خَيْمَتِكَ. 11 لأَنَّهُ يُوصِي مَلاَئِكَتَهُ بِكَ لِكَيْ يَحْفَظُوكَ فِي كُلِّ طُرُقِكَ. 12 عَلَى الأَيْدِي يَحْمِلُونَكَ لِئَلاَّ تَصْدِمَ بِحَجَرٍ رِجْلَكَ. 13 عَلَى الأَسَدِ وَالصِّلِّ تَطَأُ. الشِّبْلَ وَالثُّعْبَانَ تَدُوسُ. 14 «لأَنَّهُ تَعَلَّقَ بِي أُنَجِّيهِ. أُرَفِّعُهُ لأَنَّهُ عَرَفَ اسْمِي. 15 يَدْعُونِي فَأَسْتَجِيبُ لَهُ، مَعَهُ أَنَا فِي الضِّيقْ، أُنْقِذُهُ وَأُمَجِّدُهُ. 16 مِنْ طُولِ الأَيَّامِ أُشْبِعُهُ، وَأُرِيهِ خَلاَصِي».</p>
<h3>(رومية35:8-39)</h3>
                <p>35 مَنْ سَيَفْصِلُنَا عَنْ مَحَبَّةِ الْمَسِيحِ؟ أَشِدَّةٌ أَمْ ضَِيْقٌ أَمِ اضْطِهَادٌ أَمْ جُوعٌ أَمْ عُرْيٌ أَمْ خَطَرٌ أَمْ سَيْفٌ؟ 36 كَمَا هُوَ مَكْتُوبٌ:«إِنَّنَا مِنْ أَجْلِكَ نُمَاتُ كُلَّ النَّهَارِ. قَدْ حُسِبْنَا مِثْلَ غَنَمٍ لِلذَّبْحِ». 37 وَلكِنَّنَا فِي هذِهِ جَمِيعِهَا يَعْظُمُ انْتِصَارُنَا بِالَّذِي أَحَبَّنَا. 38 فَإِنِّي مُتَيَقِّنٌ أَنَّهُ لاَ مَوْتَ وَلاَ حَيَاةَ، وَلاَ مَلاَئِكَةَ وَلاَ رُؤَسَاءَ وَلاَ قُوَّاتِ، وَلاَ أُمُورَ حَاضِرَةً وَلاَ مُسْتَقْبَلَةً، 39 وَلاَ عُلْوَ وَلاَ عُمْقَ، وَلاَ خَلِيقَةَ أُخْرَى، تَقْدِرُ أَنْ تَفْصِلَنَا عَنْ مَحَبَّةِ اللهِ الَّتِي فِي الْمَسِيحِ يَسُوعَ رَبِّنَا.</p>
                {video && (
              <div className={styles.videoContainer}>
<iframe width="708" height="398" src="https://www.youtube.com/embed/Z4QGDv6la0g" title="الوقاية من الخطر - عظة من مؤتمر _تلذذ بالرب_ - أبونا داود لمعي - Risk prevention LGBTQ2S" frameBorder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerPolicy="strict-origin-when-cross-origin" allowFullScreen></iframe>             </div>
            )}
          </div>
        );
            case 'page17':
            return (
              <div className={styles.pageContent}>
                <h1>عند شعورك بالغيرة</h1>
                <h2>(مزمور73)</h2>
                <p>1 إِنَّمَا صَالِحٌ اللهُ لإِسْرَائِيلَ، لأَنْقِيَاءِ الْقَلْبِ. 2 أَمَّا أَنَا فَكَادَتْ تَزِلُّ قَدَمَايَ. لَوْلاَ قَلِيلٌ لَزَلِقَتْ خَطَوَاتِي. 3 لأَنِّي غِرْتُ مِنَ الْمُتَكَبِّرِينَ، إِذْ رَأَيْتُ سَلاَمَةَ الأَشْرَارِ. 4 لأَنَّهُ لَيْسَتْ فِي مَوْتِهِمْ شَدَائِدُ، وَجِسْمُهُمْ سَمِينٌ. 5 لَيْسُوا فِي تَعَبِ النَّاسِ، وَمَعَ الْبَشَرِ لاَ يُصَابُونَ. 6 لِذلِكَ تَقَلَّدُوا الْكِبْرِيَاءَ. لَبِسُوا كَثَوْبٍ ظُلْمَهُمْ. 7 جَحَظَتْ عُيُونُهُمْ مِنَ الشَّحْمِ. جَاوَزُوا تَصَوُّرَاتِ الْقَلْبِ. 8 يَسْتَهْزِئُونَ وَيَتَكَلَّمُونَ بِالشَّرِّ ظُلْمًا. مِنَ الْعَلاَءِ يَتَكَلَّمُونَ. 9 جَعَلُوا أَفْوَاهَهُمْ فِي السَّمَاءِ، وَأَلْسِنَتُهُمْ تَتَمَشَّى فِي الأَرْضِ. 10 لِذلِكَ يَرْجعُ شَعْبُهُ إِلَى هُنَا، وَكَمِيَاهٍ مُرْوِيَةٍ يُمْتَصُّونَ مِنْهُمْ. 11 وَقَالُوا: «كَيْفَ يَعْلَمُ اللهُ؟ وَهَلْ عِنْدَ الْعَلِيِّ مَعْرِفَةٌ؟ » 12 هُوَذَا هؤُلاَءِ هُمُ الأَشْرَارُ، وَمُسْتَرِيحِينَ إِلَى الدَّهْرِ يُكْثِرُونَ ثَرْوَةً.

13 حَقًّا قَدْ زَكَّيْتُ قَلْبِي بَاطِلاً وَغَسَلْتُ بِالنَّقَاوَةِ يَدَيَّ. 14 وَكُنْتُ مُصَابًا الْيَوْمَ كُلَّهُ، وَتَأَدَّبْتُ كُلَّ صَبَاحٍ. 15 لَوْ قُلْتُ أُحَدِّثُ هكَذَا، لَغَدَرْتُ بِجِيلِ بَنِيكَ. 16 فَلَمَّا قَصَدْتُ مَعْرِفَةَ هذَا، إِذَا هُوَ تَعَبٌ فِي عَيْنَيَّ. 17 حَتَّى دَخَلْتُ مَقَادِسَ اللهِ، وَانْتَبَهْتُ إِلَى آخِرَتِهِمْ. 18 حَقًّا فِي مَزَالِقَ جَعَلْتَهُمْ. أَسْقَطْتَهُمْ إِلَى الْبَوَارِ. 19 كَيْفَ صَارُوا لِلْخَرَابِ بَغْتَةً! اضْمَحَلُّوا، فَنُوا مِنَ الدَّوَاهِي. 20 كَحُلْمٍ عِنْدَ التَّيَقُّظِ يَا رَبُّ، عِنْدَ التَّيَقُّظِ تَحْتَقِرُ خَيَالَهُمْ.

21 لأَنَّهُ تَمَرْمَرَ قَلْبِي، وَانْتَخَسْتُ فِي كُلْيَتَيَّ. 22 وَأَنَا بَلِيدٌ وَلاَ أَعْرِفُ. صِرْتُ كَبَهِيمٍ عِنْدَكَ. 23 وَلكِنِّي دَائِمًا مَعَكَ. أَمْسَكْتَ بِيَدِي الْيُمْنَى. 24 بِرَأْيِكَ تَهْدِينِي، وَبَعْدُ إِلَى مَجْدٍ تَأْخُذُنِي. 25 مَنْ لِي فِي السَّمَاءِ؟ وَمَعَكَ لاَ أُرِيدُ شَيْئًا فِي الأَرْضِ. 26 قَدْ فَنِيَ لَحْمِي وَقَلْبِي. صَخْرَةُ قَلْبِي وَنَصِيبِي اللهُ إِلَى الدَّهْرِ. 27 لأَنَّهُ هُوَذَا الْبُعَدَاءُ عَنْكَ يَبِيدُونَ. تُهْلِكُ كُلَّ مَنْ يَزْنِي عَنْكَ. 28 أَمَّا أَنَا فَالاقْتِرَابُ إِلَى اللهِ حَسَنٌ لِي. جَعَلْتُ بِالسَّيِّدِ الرَّبِّ مَلْجَإِي، لأُخْبِرَ بِكُلِّ صَنَائِعِكَ.</p>
<h3>(يعقوب3:3-18)</h3>
                <p> 3 هُوَذَا الْخَيْلُ، نَضَعُ اللُّجُمَ فِي أَفْوَاهِهَا لِكَيْ تُطَاوِعَنَا، فَنُدِيرَ جِسْمَهَا كُلَّهُ. 4 هُوَذَا السُّفُنُ أَيْضًا، وَهِيَ عَظِيمَةٌ بِهذَا الْمِقْدَارِ، وَتَسُوقُهَا رِيَاحٌ عَاصِفَةٌ، تُدِيرُهَا دَفَّةٌ صَغِيرَةٌ جِدًّا إِلَى حَيْثُمَا شَاءَ قَصْدُ الْمُدِيرِ. 5 هكَذَا اللِّسَانُ أَيْضًا، هُوَ عُضْوٌ صَغِيرٌ وَيَفْتَخِرُ مُتَعَظِّمًا. هُوَذَا نَارٌ قَلِيلَةٌ، أَيَّ وُقُودٍ تُحْرِقُ؟ 6 فَاللِّسَانُ نَارٌ! عَالَمُ الإِثْمِ. هكَذَا جُعِلَ فِي أَعْضَائِنَا اللِّسَانُ، الَّذِي يُدَنِّسُ الْجِسْمَ كُلَّهُ، وَيُضْرِمُ دَائِرَةَ الْكَوْنِ، وَيُضْرَمُ مِنْ جَهَنَّمَ. 7 لأَنَّ كُلَّ طَبْعٍ لِلْوُحُوشِ وَالطُّيُورِ وَالزَّحَّافَاتِ وَالْبَحْرِيَّاتِ يُذَلَّلُ، وَقَدْ تَذَلَّلَ لِلطَّبْعِ الْبَشَرِيِّ. 8 وَأَمَّا اللِّسَانُ، فَلاَ يَسْتَطِيعُ أَحَدٌ مِنَ النَّاسِ أَنْ يُذَلِّلَهُ. هُوَ شَرٌّ لاَ يُضْبَطُ، مَمْلُوٌّ سُمًّا مُمِيتًا. 9 بِهِ نُبَارِكُ اللهَ الآبَ، وَبِهِ نَلْعَنُ النَّاسَ الَّذِينَ قَدْ تَكَوَّنُوا عَلَى شِبْهِ اللهِ. 10 مِنَ الْفَمِ الْوَاحِدِ تَخْرُجُ بَرَكَةٌ وَلَعْنَةٌ! لاَ يَصْلُحُ يَا إِخْوَتِي أَنْ تَكُونَ هذِهِ الأُمُورُ هكَذَا! 11 أَلَعَلَّ يَنْبُوعًا يُنْبِعُ مِنْ نَفْسِ عَيْنٍ وَاحِدَةٍ الْعَذْبَ وَالْمُرَّ؟ 12 هَلْ تَقْدِرُ يَا إِخْوَتِي تِينَةٌ أَنْ تَصْنَعَ زَيْتُونًا، أَوْ كَرْمَةٌ تِينًا؟ وَلاَ كَذلِكَ يَنْبُوعٌ يَصْنَعُ مَاءً مَالِحًا وَعَذْبًا!

13 مَنْ هُوَ حَكِيمٌ وَعَالِمٌ بَيْنَكُمْ، فَلْيُرِ أَعْمَالَهُ بِالتَّصَرُّفِ الْحَسَنِ فِي وَدَاعَةِ الْحِكْمَةِ. 14 وَلكِنْ إِنْ كَانَ لَكُمْ غَيْرَةٌ مُرَّةٌ وَتَحَزُّبٌ فِي قُلُوبِكُمْ، فَلاَ تَفْتَخِرُوا وَتَكْذِبُوا عَلَى الْحَقِّ. 15 لَيْسَتْ هذِهِ الْحِكْمَةُ نَازِلَةً مِنْ فَوْقُ، بَلْ هِيَ أَرْضِيَّةٌ نَفْسَانِيَّةٌ شَيْطَانِيَّةٌ. 16 لأَنَّهُ حَيْثُ الْغَيْرَةُ وَالتَّحَزُّبُ، هُنَاكَ التَّشْوِيشُ وَكُلُّ أَمْرٍ رَدِيءٍ. 17 وَأَمَّا الْحِكْمَةُ الَّتِي مِنْ فَوْقُ فَهِيَ أَوَّلاً طَاهِرَةٌ، ثُمَّ مُسَالِمَةٌ، مُتَرَفِّقَةٌ، مُذْعِنَةٌ، مَمْلُوَّةٌ رَحْمَةً وَأَثْمَارًا صَالِحَةً، عَدِيمَةُ الرَّيْبِ وَالرِّيَاءِ. 18 وَثَمَرُ الْبِرِّ يُزْرَعُ فِي السَّلاَمِ مِنَ الَّذِينَ يَفْعَلُونَ السَّلاَمَ.</p>
{video && (
              <div className={styles.videoContainer}>
<iframe width="708" height="398" src="https://www.youtube.com/embed/nAM4gjRTCdA" title="أسباب الغيرة و علاجها في 4 دقائق -  أبونا داود لمعي" frameBorder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerPolicy="strict-origin-when-cross-origin" allowFullScreen></iframe>  </div>
            )}
          </div>
        );
            case 'page18':
            return (
              <div className={styles.pageContent}>
                <h1>عند شعورك بالتعب</h1>
                <h2>(إشعياء 27:40-31)</h2>
                <p>27 لِمَاذَا تَقُولُ يَا يَعْقُوبُ وَتَتَكَلَّمُ يَا إِسْرَائِيلُ: «قَدِ اخْتَفَتْ طَرِيقِي عَنِ الرَّبِّ وَفَاتَ حَقِّي إِلهِي»؟ 28 أَمَا عَرَفْتَ أَمْ لَمْ تَسْمَعْ؟ إِلهُ الدَّهْرِ الرَّبُّ خَالِقُ أَطْرَافِ الأَرْضِ لاَ يَكِلُّ وَلاَ يَعْيَا. لَيْسَ عَنْ فَهْمِهِ فَحْصٌ. 29 يُعْطِي الْمُعْيِيَ قُدْرَةً، وَلِعَدِيمِ الْقُوَّةِ يُكَثِّرُ شِدَّةً. 30 اَلْغِلْمَانُ يُعْيُونَ وَيَتْعَبُونَ، وَالْفِتْيَانُ يَتَعَثَّرُونَ تَعَثُّرًا. 31 وَأَمَّا مُنْتَظِرُو الرَّبِّ فَيُجَدِّدُونَ قُوَّةً. يَرْفَعُونَ أَجْنِحَةً كَالنُّسُورِ. يَرْكُضُونَ وَلاَ يَتْعَبُونَ. يَمْشُونَ وَلاَ يُعْيُونَ.</p>
                <h3>(متى25:11-30)</h3>
                <p>25 فِي ذلِكَ الْوَقْتِ أَجَابَ يَسُوعُ وَقَالَ: «أَحْمَدُكَ أَيُّهَا الآبُ رَبُّ السَّمَاءِ وَالأَرْضِ، لأَنَّكَ أَخْفَيْتَ هذِهِ عَنِ الْحُكَمَاءِ وَالْفُهَمَاءِ وَأَعْلَنْتَهَا لِلأَطْفَالِ. 26 نَعَمْ أَيُّهَا الآبُ، لأَنْ هكَذَا صَارَتِ الْمَسَرَّةُ أَمَامَكَ. 27 كُلُّ شَيْءٍ قَدْ دُفِعَ إِلَيَّ مِنْ أَبِي، وَلَيْسَ أَحَدٌ يَعْرِفُ الابْنَ إِلاَّ الآبُ، وَلاَ أَحَدٌ يَعْرِفُ الآبَ إِلاَّ الابْنُ وَمَنْ أَرَادَ الابْنُ أَنْ يُعْلِنَ لَهُ. 28 تَعَالَوْا إِلَيَّ يَا جَمِيعَ الْمُتْعَبِينَ وَالثَّقِيلِي الأَحْمَالِ، وَأَنَا أُرِيحُكُمْ. 29 اِحْمِلُوا نِيرِي عَلَيْكُمْ وَتَعَلَّمُوا مِنِّي، لأَنِّي وَدِيعٌ وَمُتَوَاضِعُ الْقَلْبِ، فَتَجِدُوا رَاحَةً لِنُفُوسِكُمْ. 30 لأَنَّ نِيرِي هَيِّنٌ وَحِمْلِي خَفِيفٌ».</p>
                {video && (
              <div className={styles.videoContainer}>
<iframe width="534" height="398" src="https://www.youtube.com/embed/qToBMcff7qY" title="تعب الأعصاب † عظه للبابا شنوده الثالث † 1988" frameBorder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerPolicy="strict-origin-when-cross-origin" allowFullScreen></iframe> </div>
            )}
          </div>
        );
            case 'page19':
            return (
              <div className={styles.pageContent}>
                <h1>عند شعورك بالعجز</h1>
                <h2>(مزمور38)</h2>
                <p>1 يَا رَبُّ، لاَ تُوَبِّخْنِي بِسَخَطِكَ، وَلاَ تُؤَدِّبْنِي بِغَيْظِكَ، 2 لأَنَّ سِهَامَكَ قَدِ انْتَشَبَتْ فِيَّ، وَنَزَلَتْ عَلَيَّ يَدُكَ. 3 لَيْسَتْ فِي جَسَدِي صِحَّةٌ مِنْ جِهَةِ غَضَبِكَ. لَيْسَتْ فِي عِظَامِي سَلاَمَةٌ مِنْ جِهَةِ خَطِيَّتِي. 4 لأَنَّ آثامِي قَدْ طَمَتْ فَوْقَ رَأْسِي. كَحِمْل ثَقِيل أَثْقَلَ مِمَّا أَحْتَمِلُ. 5 قَدْ أَنْتَنَتْ، قَاحَتْ حُبُرُ ضَرْبِي مِنْ جِهَةِ حَمَاقَتِي. 6 لَوِيتُ. انْحَنَيْتُ إِلَى الْغَايَةِ. الْيَوْمَ كُلَّهُ ذَهَبْتُ حَزِينًا. 7 لأَنَّ خَاصِرَتَيَّ قَدِ امْتَلأَتَا احْتِرَاقًا، وَلَيْسَتْ فِي جَسَدِي صِحَّةٌ. 8 خَدِرْتُ وَانْسَحَقْتُ إِلَى الْغَايَةِ. كُنْتُ أَئِنُّ مِنْ زَفِيرِ قَلْبِي.

9 يَا رَبُّ، أَمَامَكَ كُلُّ تَأَوُّهِي، وَتَنَهُّدِي لَيْسَ بِمَسْتُورٍ عَنْكَ. 10 قَلْبِي خَافِقٌ. قُوَّتِي فَارَقَتْنِي، وَنُورُ عَيْنِي أَيْضًا لَيْسَ مَعِي. 11 أَحِبَّائِي وَأَصْحَابِي يَقِفُونَ تُجَاهَ ضَرْبَتِي، وَأَقَارِبِي وَقَفُوا بَعِيدًا. 12 وَطَالِبُو نَفْسِي نَصَبُوا شَرَكًا، وَالْمُلْتَمِسُونَ لِيَ الشَّرَّ تَكَلَّمُوا بِالْمَفَاسِدِ، وَالْيَوْمَ كُلَّهُ يَلْهَجُونَ بِالْغِشِّ.

13 وَأَمَّا أَنَا فَكَأَصَمَّ لاَ أَسْمَعُ. وَكَأَبْكَمَ لاَ يَفْتَحُ فَاهُ. 14 وَأَكُونُ مِثْلَ إِنْسَانٍلاَ يَسْمَعُ، وَلَيْسَ فِي فَمِهِ حُجَّةٌ. 15 لأَنِّي لَكَ يَا رَبُّ صَبَرْتُ، أَنْتَ تَسْتَجِيبُ يَا رَبُّ إِلهِي. 16 لأَنِّي قُلْتُ: «لِئَلاَّ يَشْمَتُوا بِي». عِنْدَمَا زَلَّتْ قَدَمِي تَعَظَّمُوا عَلَيَّ. 17 لأَنِّي مُوشِكٌ أَنْ أَظْلَعَ، وَوَجَعِي مُقَابِلِي دَائِمًا. 18 لأَنَّنِي أُخْبِرُ بِإِثْمِي، وَأَغْتَمُّ مِنْ خَطِيَّتِي. 19 وَأَمَّا أَعْدَائِي فَأَحْيَاءٌ. عَظُمُوا. وَالَّذِينَ يُبْغِضُونَنِي ظُلْمًا كَثُرُوا. 20 وَالْمُجَازُونَ عَنِ الْخَيْرِ بِشَرّ، يُقَاوِمُونَنِي لأَجْلِ اتِّبَاعِي الصَّلاَحَ. 21 لاَ تَتْرُكْنِي يَا رَبُّ. يَا إِلهِي، لاَ تَبْعُدْ عَنِّي. 22 أَسْرِعْ إِلَى مَعُونَتِي يَا رَبُّ يَا خَلاَصِي.</p>
<h3>(رومية6:5-11)</h3>
                <p>6 لأَنَّ الْمَسِيحَ، إِذْ كُنَّا بَعْدُ ضُعَفَاءَ، مَاتَ فِي الْوَقْتِ الْمُعَيَّنِ لأَجْلِ الْفُجَّارِ. 7 فَإِنَّهُ بِالْجَهْدِ يَمُوتُ أَحَدٌ لأَجْلِ بَارّ. رُبَّمَا لأَجْلِ الصَّالِحِ يَجْسُرُ أَحَدٌ أَيْضًا أَنْ يَمُوتَ. 8 وَلكِنَّ اللهَ بَيَّنَ مَحَبَّتَهُ لَنَا، لأَنَّهُ وَنَحْنُ بَعْدُ خُطَاةٌ مَاتَ الْمَسِيحُ لأَجْلِنَا. 9 فَبِالأَوْلَى كَثِيرًا وَنَحْنُ مُتَبَرِّرُونَ الآنَ بِدَمِهِ نَخْلُصُ بِهِ مِنَ الْغَضَبِ! 10 لأَنَّهُ إِنْ كُنَّا وَنَحْنُ أَعْدَاءٌ قَدْ صُولِحْنَا مَعَ اللهِ بِمَوْتِ ابْنِهِ، فَبِالأَوْلَى كَثِيرًا وَنَحْنُ مُصَالَحُونَ نَخْلُصُ بِحَيَاتِهِ! 11 وَلَيْسَ ذلِكَ فَقَطْ، بَلْ نَفْتَخِرُ أَيْضًا بِاللهِ، بِرَبِّنَا يَسُوعَ الْمَسِيحِ، الَّذِي نِلْنَا بِهِ الآنَ الْمُصَالَحَةَ.</p>
                {video && (
              <div className={styles.videoContainer}>
<iframe width="708" height="398" src="https://www.youtube.com/embed/naRfGx8UF2Y" title="كفاياك عولان الهم وبلاش شيل المشاكل وماتفكرش وتتعب سيبها لربنا يحلها وماتستعجلهوش وماتقترحش عليه حل" frameBorder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerPolicy="strict-origin-when-cross-origin" allowFullScreen></iframe></div>
            )}
          </div>
        );
            case 'page20':
            return (
              <div className={styles.pageContent}>
                <h1>عند شعورك بالنبذ</h1>
                <h2>(مزمور43)</h2>
                <p>1 اِقْضِ لِي يَا اَللهُ، وَخَاصِمْ مُخَاصَمَتِي مَعَ أُمَّةٍ غَيْرِ رَاحِمَةٍ، وَمِنْ إِنْسَانِ غِشٍّ وَظُلْمٍ نَجِّنِي. 2 لأَنَّكَ أَنْتَ إِلهُ حِصْنِي. لِمَاذَا رَفَضْتَنِي؟ لِمَاذَا أَتَمَشَّى حَزِينًا مِنْ مُضَايَقَةِ الْعَدُوِّ؟ 3 أَرْسِلْ نُورَكَ وَحَقَّكَ، هُمَا يَهْدِيَانِنِي وَيَأْتِيَانِ بِي إِلَى جَبَلِ قُدْسِكَ وَإِلَى مَسَاكِنِكَ. 4 فَآتِي إِلَى مَذْبَحِ اللهِ، إِلَى اللهِ بَهْجَةِ فَرَحِي، وَأَحْمَدُكَ بِالْعُودِ يَا اَللهُ إِلهِي. 5 لِمَاذَا أَنْتِ مُنْحَنِيَةٌ يَا نَفْسِي؟ وَلِمَاذَا تَئِنِّينَ فِيَّ؟ تَرَجَّيِ اللهَ، لأَنِّي بَعْدُ أَحْمَدُهُ، خَلاَصَ وَجْهِي وَإِلهِي.</p>
                <h3>(متى10:5-12)</h3>
                <p>10 طُوبَى لِلْمَطْرُودِينَ مِنْ أَجْلِ الْبِرِّ، لأَنَّ لَهُمْ مَلَكُوتَ السَّمَاوَاتِ. 11 طُوبَى لَكُمْ إِذَا عَيَّرُوكُمْ وَطَرَدُوكُمْ وَقَالُوا عَلَيْكُمْ كُلَّ كَلِمَةٍ شِرِّيرَةٍ، مِنْ أَجْلِي، كَاذِبِينَ. 12 اِفْرَحُوا وَتَهَلَّلُوا، لأَنَّ أَجْرَكُمْ عَظِيمٌ فِي السَّمَاوَاتِ، فَإِنَّهُمْ هكَذَا طَرَدُوا الأَنْبِيَاءَ الَّذِينَ قَبْلَكُمْ.</p>
                {video && (
              <div className={styles.videoContainer}>
<iframe width="708" height="398" src="https://www.youtube.com/embed/Z7nM64V2esU" title="رسالة إلى كل واحد مظلوم - سلسلة رسالة إلى .. - أبونا داود لمعي" frameBorder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerPolicy="strict-origin-when-cross-origin" allowFullScreen></iframe></div>
            )}
          </div>
        );
            case 'page21':
            return (
              <div className={styles.pageContent}>
                <h1>عند شعورك بالتدني</h1>
                <h2>(إرميا4:1-10)</h2>
                <p>4 فَكَانَتْ كَلِمَةُ الرَّبِّ إِلَيَّ قَائِلاً: 5 «قَبْلَمَا صَوَّرْتُكَ فِي الْبَطْنِ عَرَفْتُكَ، وَقَبْلَمَا خَرَجْتَ مِنَ الرَّحِمِ قَدَّسْتُكَ. جَعَلْتُكَ نَبِيًّا لِلشُّعُوبِ». 6 فَقُلْتُ: «آهِ، يَا سَيِّدُ الرَّبُّ، إِنِّي لاَ أَعْرِفُ أَنْ أَتَكَلَّمَ لأَنِّي وَلَدٌ». 7 فَقَالَ الرَّبُّ لِي: «لاَ تَقُلْ إِنِّي وَلَدٌ، لأَنَّكَ إِلَى كُلِّ مَنْ أُرْسِلُكَ إِلَيْهِ تَذْهَبُ وَتَتَكَلَّمُ بِكُلِّ مَا آمُرُكَ بِهِ. 8 لاَ تَخَفْ مِنْ وُجُوهِهِمْ، لأَنِّي أَنَا مَعَكَ لأُنْقِذَكَ، يَقُولُ الرَّبُّ». 9 وَمَدَّ الرَّبُّ يَدَهُ وَلَمَسَ فَمِي، وَقَالَ الرَّبُّ لِي: «هَا قَدْ جَعَلْتُ كَلاَمِي فِي فَمِكَ. 10 اُنْظُرْ! قَدْ وَكَّلْتُكَ هذَا الْيَوْمَ عَلَى الشُّعُوبِ وَعَلَى الْمَمَالِكِ، لِتَقْلَعَ وَتَهْدِمَ وَتُهْلِكَ وَتَنْقُضَ وَتَبْنِيَ وَتَغْرِسَ».</p>
                <h3>(1بطرس4:2-10)</h3>
                <p>4 الَّذِي إِذْ تَأْتُونَ إِلَيْهِ، حَجَرًا حَيًّا مَرْفُوضًا مِنَ النَّاسِ، وَلكِنْ مُخْتَارٌ مِنَ اللهِ كَرِيمٌ، 5 كُونُوا أَنْتُمْ أَيْضًا مَبْنِيِّينَ ­كَحِجَارَةٍ حَيَّةٍ­ بَيْتًا رُوحِيًّا، كَهَنُوتًا مُقَدَّسًا، لِتَقْدِيمِ ذَبَائِحَ رُوحِيَّةٍ مَقْبُولَةٍ عِنْدَ اللهِ بِيَسُوعَ الْمَسِيحِ. 6 لِذلِكَ يُتَضَمَّنُ أَيْضًا فِي الْكِتَابِ:«هنَذَا أَضَعُ فِي صِهْيَوْنَ حَجَرَ زَاوِيَةٍ مُخْتَارًا كَرِيمًا، وَالَّذِي يُؤْمِنُ بِهِ لَنْ يُخْزَى». 7 فَلَكُمْ أَنْتُمُ الَّذِينَ تُؤْمِنُونَ الْكَرَامَةُ، وَأَمَّا لِلَّذِينَ لاَ يُطِيعُونَ، «فَالْحَجَرُ الَّذِي رَفَضَهُ الْبَنَّاؤُونَ، هُوَ قَدْ صَارَ رَأْسَ الزَّاوِيَةِ» 8 «وَحَجَرَ صَدْمَةٍ وَصَخْرَةَ عَثْرَةٍ. الَّذِينَ يَعْثُرُونَ غَيْرَ طَائِعِينَ لِلْكَلِمَةِ، الأَمْرُ الَّذِي جُعِلُوا لَهُ» 9 وَأَمَّا أَنْتُمْ فَجِنْسٌ مُخْتَارٌ، وَكَهَنُوتٌ مُلُوكِيٌّ، أُمَّةٌ مُقَدَّسَةٌ، شَعْبُ اقْتِنَاءٍ، لِكَيْ تُخْبِرُوا بِفَضَائِلِ الَّذِي دَعَاكُمْ مِنَ الظُّلْمَةِ إِلَى نُورِهِ الْعَجِيبِ. 10 الَّذِينَ قَبْلاً لَمْ تَكُونُوا شَعْبًا، وَأَمَّا الآنَ فَأَنْتُمْ شَعْبُ اللهِ. الَّذِينَ كُنْتُمْ غَيْرَ مَرْحُومِينَ، وَأَمَّا الآنَ فَمَرْحُومُونَ.</p>
                {video && (
              <div className={styles.videoContainer}>
<iframe width="708" height="398" src="https://www.youtube.com/embed/8d2P2EgDb_Q" title="عظة شجعوا صغار النفوس عظة ملائكية كما لم تسمعها من قبل | للانبا كاراس اسقف المحلة" frameBorder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerPolicy="strict-origin-when-cross-origin" allowFullScreen></iframe></div>
            )}
          </div>
        );
            
      default:
        return <p>Page not found</p>;
    }
  };

  return <Layout>{renderContent()}</Layout>;
};

export default Page;
